{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: langchain-community in ./myenv/lib/python3.9/site-packages (0.3.15)\n",
      "Requirement already satisfied: langchain-core in ./myenv/lib/python3.9/site-packages (0.3.31)\n",
      "Requirement already satisfied: requests<3,>=2 in ./myenv/lib/python3.9/site-packages (from langchain-community) (2.32.3)\n",
      "Requirement already satisfied: langchain<0.4.0,>=0.3.15 in ./myenv/lib/python3.9/site-packages (from langchain-community) (0.3.15)\n",
      "Requirement already satisfied: SQLAlchemy<3,>=1.4 in ./myenv/lib/python3.9/site-packages (from langchain-community) (2.0.37)\n",
      "Requirement already satisfied: langsmith<0.4,>=0.1.125 in ./myenv/lib/python3.9/site-packages (from langchain-community) (0.3.1)\n",
      "Requirement already satisfied: numpy<2,>=1.22.4 in ./myenv/lib/python3.9/site-packages (from langchain-community) (1.26.4)\n",
      "Requirement already satisfied: pydantic-settings<3.0.0,>=2.4.0 in ./myenv/lib/python3.9/site-packages (from langchain-community) (2.7.1)\n",
      "Requirement already satisfied: httpx-sse<0.5.0,>=0.4.0 in ./myenv/lib/python3.9/site-packages (from langchain-community) (0.4.0)\n",
      "Requirement already satisfied: aiohttp<4.0.0,>=3.8.3 in ./myenv/lib/python3.9/site-packages (from langchain-community) (3.11.11)\n",
      "Requirement already satisfied: tenacity!=8.4.0,<10,>=8.1.0 in ./myenv/lib/python3.9/site-packages (from langchain-community) (9.0.0)\n",
      "Requirement already satisfied: dataclasses-json<0.7,>=0.5.7 in ./myenv/lib/python3.9/site-packages (from langchain-community) (0.6.7)\n",
      "Requirement already satisfied: PyYAML>=5.3 in ./myenv/lib/python3.9/site-packages (from langchain-community) (6.0.2)\n",
      "Requirement already satisfied: pydantic<3.0.0,>=2.5.2 in ./myenv/lib/python3.9/site-packages (from langchain-core) (2.10.6)\n",
      "Requirement already satisfied: jsonpatch<2.0,>=1.33 in ./myenv/lib/python3.9/site-packages (from langchain-core) (1.33)\n",
      "Requirement already satisfied: packaging<25,>=23.2 in ./myenv/lib/python3.9/site-packages (from langchain-core) (24.2)\n",
      "Requirement already satisfied: typing-extensions>=4.7 in ./myenv/lib/python3.9/site-packages (from langchain-core) (4.12.2)\n",
      "Requirement already satisfied: aiohappyeyeballs>=2.3.0 in ./myenv/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (2.4.4)\n",
      "Requirement already satisfied: async-timeout<6.0,>=4.0 in ./myenv/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (4.0.3)\n",
      "Requirement already satisfied: aiosignal>=1.1.2 in ./myenv/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (1.3.2)\n",
      "Requirement already satisfied: propcache>=0.2.0 in ./myenv/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (0.2.1)\n",
      "Requirement already satisfied: yarl<2.0,>=1.17.0 in ./myenv/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (1.18.3)\n",
      "Requirement already satisfied: multidict<7.0,>=4.5 in ./myenv/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (6.1.0)\n",
      "Requirement already satisfied: attrs>=17.3.0 in ./myenv/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (25.1.0)\n",
      "Requirement already satisfied: frozenlist>=1.1.1 in ./myenv/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community) (1.5.0)\n",
      "Requirement already satisfied: marshmallow<4.0.0,>=3.18.0 in ./myenv/lib/python3.9/site-packages (from dataclasses-json<0.7,>=0.5.7->langchain-community) (3.26.0)\n",
      "Requirement already satisfied: typing-inspect<1,>=0.4.0 in ./myenv/lib/python3.9/site-packages (from dataclasses-json<0.7,>=0.5.7->langchain-community) (0.9.0)\n",
      "Requirement already satisfied: jsonpointer>=1.9 in ./myenv/lib/python3.9/site-packages (from jsonpatch<2.0,>=1.33->langchain-core) (3.0.0)\n",
      "Requirement already satisfied: langchain-text-splitters<0.4.0,>=0.3.3 in ./myenv/lib/python3.9/site-packages (from langchain<0.4.0,>=0.3.15->langchain-community) (0.3.5)\n",
      "Requirement already satisfied: httpx<1,>=0.23.0 in ./myenv/lib/python3.9/site-packages (from langsmith<0.4,>=0.1.125->langchain-community) (0.28.1)\n",
      "Requirement already satisfied: requests-toolbelt<2.0.0,>=1.0.0 in ./myenv/lib/python3.9/site-packages (from langsmith<0.4,>=0.1.125->langchain-community) (1.0.0)\n",
      "Requirement already satisfied: zstandard<0.24.0,>=0.23.0 in ./myenv/lib/python3.9/site-packages (from langsmith<0.4,>=0.1.125->langchain-community) (0.23.0)\n",
      "Requirement already satisfied: orjson<4.0.0,>=3.9.14 in ./myenv/lib/python3.9/site-packages (from langsmith<0.4,>=0.1.125->langchain-community) (3.10.15)\n",
      "Requirement already satisfied: anyio in ./myenv/lib/python3.9/site-packages (from httpx<1,>=0.23.0->langsmith<0.4,>=0.1.125->langchain-community) (4.8.0)\n",
      "Requirement already satisfied: certifi in ./myenv/lib/python3.9/site-packages (from httpx<1,>=0.23.0->langsmith<0.4,>=0.1.125->langchain-community) (2024.12.14)\n",
      "Requirement already satisfied: idna in ./myenv/lib/python3.9/site-packages (from httpx<1,>=0.23.0->langsmith<0.4,>=0.1.125->langchain-community) (3.10)\n",
      "Requirement already satisfied: httpcore==1.* in ./myenv/lib/python3.9/site-packages (from httpx<1,>=0.23.0->langsmith<0.4,>=0.1.125->langchain-community) (1.0.7)\n",
      "Requirement already satisfied: h11<0.15,>=0.13 in ./myenv/lib/python3.9/site-packages (from httpcore==1.*->httpx<1,>=0.23.0->langsmith<0.4,>=0.1.125->langchain-community) (0.14.0)\n",
      "Requirement already satisfied: annotated-types>=0.6.0 in ./myenv/lib/python3.9/site-packages (from pydantic<3.0.0,>=2.5.2->langchain-core) (0.7.0)\n",
      "Requirement already satisfied: pydantic-core==2.27.2 in ./myenv/lib/python3.9/site-packages (from pydantic<3.0.0,>=2.5.2->langchain-core) (2.27.2)\n",
      "Requirement already satisfied: python-dotenv>=0.21.0 in ./myenv/lib/python3.9/site-packages (from pydantic-settings<3.0.0,>=2.4.0->langchain-community) (1.0.1)\n",
      "Requirement already satisfied: charset-normalizer<4,>=2 in ./myenv/lib/python3.9/site-packages (from requests<3,>=2->langchain-community) (3.4.1)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in ./myenv/lib/python3.9/site-packages (from requests<3,>=2->langchain-community) (2.3.0)\n",
      "Requirement already satisfied: mypy-extensions>=0.3.0 in ./myenv/lib/python3.9/site-packages (from typing-inspect<1,>=0.4.0->dataclasses-json<0.7,>=0.5.7->langchain-community) (1.0.0)\n",
      "Requirement already satisfied: sniffio>=1.1 in ./myenv/lib/python3.9/site-packages (from anyio->httpx<1,>=0.23.0->langsmith<0.4,>=0.1.125->langchain-community) (1.3.1)\n",
      "Requirement already satisfied: exceptiongroup>=1.0.2 in ./myenv/lib/python3.9/site-packages (from anyio->httpx<1,>=0.23.0->langsmith<0.4,>=0.1.125->langchain-community) (1.2.2)\n",
      "\u001b[33mWARNING: You are using pip version 21.2.4; however, version 25.0 is available.\n",
      "You should consider upgrading via the '/Users/jerry/Desktop/FYP-working/fine-tune-openai-KGQA/myenv/bin/python -m pip install --upgrade pip' command.\u001b[0m\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Requirement already satisfied: sklearn in ./myenv/lib/python3.9/site-packages (0.0)\n",
      "Requirement already satisfied: scikit-learn in ./myenv/lib/python3.9/site-packages (from sklearn) (1.6.1)\n",
      "Requirement already satisfied: numpy>=1.19.5 in ./myenv/lib/python3.9/site-packages (from scikit-learn->sklearn) (1.26.4)\n",
      "Requirement already satisfied: joblib>=1.2.0 in ./myenv/lib/python3.9/site-packages (from scikit-learn->sklearn) (1.4.2)\n",
      "Requirement already satisfied: threadpoolctl>=3.1.0 in ./myenv/lib/python3.9/site-packages (from scikit-learn->sklearn) (3.5.0)\n",
      "Requirement already satisfied: scipy>=1.6.0 in ./myenv/lib/python3.9/site-packages (from scikit-learn->sklearn) (1.13.1)\n",
      "\u001b[33mWARNING: You are using pip version 21.2.4; however, version 25.0 is available.\n",
      "You should consider upgrading via the '/Users/jerry/Desktop/FYP-working/fine-tune-openai-KGQA/myenv/bin/python -m pip install --upgrade pip' command.\u001b[0m\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Requirement already satisfied: pandas in ./myenv/lib/python3.9/site-packages (2.2.3)\n",
      "Requirement already satisfied: pytz>=2020.1 in ./myenv/lib/python3.9/site-packages (from pandas) (2024.2)\n",
      "Requirement already satisfied: python-dateutil>=2.8.2 in ./myenv/lib/python3.9/site-packages (from pandas) (2.9.0.post0)\n",
      "Requirement already satisfied: tzdata>=2022.7 in ./myenv/lib/python3.9/site-packages (from pandas) (2025.1)\n",
      "Requirement already satisfied: numpy>=1.22.4 in ./myenv/lib/python3.9/site-packages (from pandas) (1.26.4)\n",
      "Requirement already satisfied: six>=1.5 in ./myenv/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)\n",
      "\u001b[33mWARNING: You are using pip version 21.2.4; however, version 25.0 is available.\n",
      "You should consider upgrading via the '/Users/jerry/Desktop/FYP-working/fine-tune-openai-KGQA/myenv/bin/python -m pip install --upgrade pip' command.\u001b[0m\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Requirement already satisfied: nltk in ./myenv/lib/python3.9/site-packages (3.9.1)\n",
      "Requirement already satisfied: click in ./myenv/lib/python3.9/site-packages (from nltk) (8.1.8)\n",
      "Requirement already satisfied: tqdm in ./myenv/lib/python3.9/site-packages (from nltk) (4.67.1)\n",
      "Requirement already satisfied: regex>=2021.8.3 in ./myenv/lib/python3.9/site-packages (from nltk) (2024.11.6)\n",
      "Requirement already satisfied: joblib in ./myenv/lib/python3.9/site-packages (from nltk) (1.4.2)\n",
      "\u001b[33mWARNING: You are using pip version 21.2.4; however, version 25.0 is available.\n",
      "You should consider upgrading via the '/Users/jerry/Desktop/FYP-working/fine-tune-openai-KGQA/myenv/bin/python -m pip install --upgrade pip' command.\u001b[0m\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "%pip install langchain-community langchain-core\n",
    "%pip install sklearn\n",
    "%pip install pandas\n",
    "%pip install nltk\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import json\n",
    "import rdflib\n",
    "import random\n",
    "from typing import List\n",
    "from openai import OpenAI\n",
    "from dotenv import load_dotenv\n",
    "from langchain_community.graphs import OntotextGraphDBGraph\n",
    "from constants import (\n",
    "    TRAINED_MODEL_ID_PATH,\n",
    "    TEST_DATA_PATH,\n",
    "    SPARQL_FIX_PROMPT,\n",
    "    QA_PROMPT,\n",
    "    SPARQL_GENERATION_PROMPT,\n",
    ")\n",
    "from sklearn.metrics import precision_score, recall_score, f1_score, accuracy_score\n",
    "from nltk.translate.bleu_score import sentence_bleu\n",
    "import pandas as pd\n",
    "from tqdm import tqdm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "class CustomOntotextGraphDBGraph(OntotextGraphDBGraph):\n",
    "    def query(\n",
    "        self,\n",
    "        query: str,\n",
    "    ) -> List[rdflib.query.ResultRow]:\n",
    "        \"\"\"\n",
    "        Query the graph.\n",
    "        \"\"\"\n",
    "        from rdflib.query import ResultRow\n",
    "\n",
    "        res = self.graph.query(query)\n",
    "        if res.type == \"ASK\":\n",
    "            return [r for r in res if isinstance(r, bool)]\n",
    "        return [r for r in res if isinstance(r, ResultRow)]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Create Graph OBJ\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph object created successfully.\n"
     ]
    }
   ],
   "source": [
    "config = {\n",
    "    \"query_endpoint\": \"http://localhost:7200/repositories/imkg\",\n",
    "    \"local_file\": \"/Users/jerry/Desktop/FYP-working/fine-tune-openai-KGQA/KG/iMKG.ttl\",\n",
    "    \"local_file_format\": \"turtle\",\n",
    "}\n",
    "try:\n",
    "    graph = CustomOntotextGraphDBGraph(**config)\n",
    "    print(\"Graph object created successfully.\")\n",
    "except Exception as e:\n",
    "    print(\"Failed to create graph object:\", e)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Model name: ft:gpt-4o-2024-08-06:personal::AyvemhXl\n"
     ]
    }
   ],
   "source": [
    "client = OpenAI()\n",
    "with open(TRAINED_MODEL_ID_PATH, \"r\", encoding=\"utf-8\") as f:\n",
    "    model_name = f.read()\n",
    "f.close()\n",
    "print(f\"Model name: {model_name}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Test data point:\n",
      "{\n",
      "    \"qid\": \"mcqa-9279b7bd-e67e-11ee-b2b4-58961d663d9c\",\n",
      "    \"question\": \"Can you tell me which actor was in both [One-Trick Pony] and the film [The Beastmaster]?\",\n",
      "    \"question_type\": \"movie_to_actor_constraint_movie\",\n",
      "    \"topic_entity\": [\n",
      "        \"One-Trick Pony\",\n",
      "        \"The Beastmaster\"\n",
      "    ],\n",
      "    \"topic_entity_id\": [\n",
      "        \"https://www.wikidata.org/entity/Q4045814\",\n",
      "        \"https://www.wikidata.org/entity/Q813050\"\n",
      "    ],\n",
      "    \"answer\": [\n",
      "        \"Rip Torn\"\n",
      "    ],\n",
      "    \"answer_id\": [\n",
      "        \"https://www.wikidata.org/entity/Q313522\"\n",
      "    ],\n",
      "    \"sparql\": \"PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?e1 ?rel ?uri; rdfs:label \\\"One-Trick Pony\\\" . ?e3 ?rel ?uri; rdfs:label \\\"The Beastmaster\\\" . ?rel rdfs:label \\\"starred_actors\\\" . ?uri rdfs:label ?label . }\"\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "TEST_DATA_PATH = os.path.join(os.getcwd(), \"data\", \"qa_test.json\")\n",
    "with open(TEST_DATA_PATH, \"r\", encoding=\"utf-8\") as f:\n",
    "    test_dataset = json.load(f)\n",
    "\n",
    "test_data_point = random.sample(test_dataset, 1)[0]\n",
    "print(f\"Test data point:\\n{json.dumps(test_data_point, indent=4)}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Call OPENAI FINETUNE MODEL\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": [
    "def call_openai(messages: list, model_name, **kwargs) -> str:\n",
    "    print(f\"Messages: {messages}\")\n",
    "    print(f\"Model: {model_name}\")\n",
    "    response = client.chat.completions.create(\n",
    "        messages=messages, model=model_name, **kwargs\n",
    "    )\n",
    "\n",
    "    return response.choices[0].message.content"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Messages: [{'role': 'system', 'content': '\\nYou are a useful SparQL assistant. You are tasked to review a question and generate a SparQL to answer the question.\\nSparQL Database used is WikiData. [<text>] is topic entity in the question.\\nOnly use these two prefixes PREFIX wd: <https://www.wikidata.org/entity/> and PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> if needed.\\nDo not use wdt syntax to query WikiData\\n'}, {'role': 'user', 'content': 'Can you tell me which actor was in both [One-Trick Pony] and the film [The Beastmaster]?'}]\n",
      "Model: ft:gpt-4o-2024-08-06:personal::AyvemhXl\n",
      "Generated SparQL:\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?e1 ?rel ?uri; rdfs:label \"One-Trick Pony\" . ?e3 ?rel ?uri; rdfs:label \"The Beastmaster\" . ?rel rdfs:label \"starred_actors\" . ?uri rdfs:label ?label . }\n"
     ]
    }
   ],
   "source": [
    "query_generation_messages = [\n",
    "    {\"role\": \"system\", \"content\": SPARQL_GENERATION_PROMPT},\n",
    "    {\"role\": \"user\", \"content\": f\"{test_data_point['question']}\"},\n",
    "]\n",
    "query = call_openai(\n",
    "    messages=query_generation_messages, model_name=model_name, temperature=0, top_p=0\n",
    ")\n",
    "print(f\"Generated SparQL:\\n{query}\")\n",
    "# add generated query into data point ban dau"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Dump answer results\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'qid': 'mcqa-9274ab0a-e67e-11ee-88b8-58961d663d9c', 'question': 'which actor starred in the movies written by [Susan Hill] and was also in [The Woman in Black]?', 'question_type': 'writer_to_movie_to_actor_constraint_movie', 'topic_entity': ['Susan Hill', 'The Woman in Black'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q269982', 'https://www.wikidata.org/entity/Q21185894', 'https://www.wikidata.org/entity/Q3490770', 'https://www.wikidata.org/entity/Q65044097', 'https://www.wikidata.org/entity/Q841274'], 'answer': ['Adrian Rawlins', 'Trevor Cooper', 'Peter Guinness', 'David Ryall', 'Pauline Moran', 'Steven Mackintosh', 'John Cater', 'Andy Nyman', 'Clare Holman', 'David Daker', 'Bernard Hepton', 'Caroline John', 'Ciarán Hinds', 'Daniel Radcliffe', 'Shaun Dooley', 'Janet McTeer', 'Roger Allam', 'Liz White', 'Jessica Raine', 'Sophie Stuckey', 'David Burke'], 'answer_id': ['https://www.wikidata.org/entity/Q374041', 'https://www.wikidata.org/entity/Q7839105', 'https://www.wikidata.org/entity/Q2602031', 'https://www.wikidata.org/entity/Q2492063', 'https://www.wikidata.org/entity/Q299621', 'https://www.wikidata.org/entity/Q1339924', 'https://www.wikidata.org/entity/Q517880', 'https://www.wikidata.org/entity/Q526886', 'https://www.wikidata.org/entity/Q209107', 'https://www.wikidata.org/entity/Q1174148', 'https://www.wikidata.org/entity/Q2898054', 'https://www.wikidata.org/entity/Q440678', 'https://www.wikidata.org/entity/Q314892', 'https://www.wikidata.org/entity/Q38119', 'https://www.wikidata.org/entity/Q7490831', 'https://www.wikidata.org/entity/Q232292', 'https://www.wikidata.org/entity/Q2424994', 'https://www.wikidata.org/entity/Q442142', 'https://www.wikidata.org/entity/Q6187419', 'https://www.wikidata.org/entity/Q3964955', 'https://www.wikidata.org/entity/Q902584'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\". ?e1 rdfs:label \"Susan Hill\" . ?rel2 rdfs:label \"starred_actors\" . ?e2 ?rel1 ?e1 ; ?rel2 ?uri . ?uri rdfs:label ?label . FILTER (?label != \"Susan Hill\") ?rel4 rdfs:label \"starred_actors\" . ?e4 ?rel4 ?uri ; rdfs:label \"The Woman in Black\" . }'}, {'qid': 'mcqa-9274ab0b-e67e-11ee-bbf3-58961d663d9c', 'question': 'Can you inform me if [Starblack] had [Typhoid Mary] as its writer?', 'question_type': 'yesno_movie_writer', 'topic_entity': ['Starblack', 'Typhoid Mary'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1232079', 'https://www.wikidata.org/entity/Q238948'], 'answer': ['NO'], 'answer_id': [], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK { ?movie wd:P58 ?e1 ; rdfs:label \"Starblack\" . ?e1 rdfs:label \"Typhoid Mary\". }'}, {'qid': 'mcqa-9274ab0c-e67e-11ee-881e-58961d663d9c', 'question': 'Discover if [X-25 javlja] is classified under multiple genres.', 'question_type': 'yesno_movie_multi_genres', 'topic_entity': ['X-25 javlja'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q26970559'], 'answer': ['YES'], 'answer_id': [], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK { ?movie wd:P136 ?e1 ; wd:P136 ?e2; rdfs:label \"X-25 javlja\". FILTER (?e1 != ?e2) }'}, {'qid': 'mcqa-9274ab0d-e67e-11ee-9175-58961d663d9c', 'question': 'What [peter jackson] movies were written by [Peter Jackson]?', 'question_type': 'tag_to_movie_constraint_writer', 'topic_entity': ['peter jackson', 'Peter Jackson'], 'topic_entity_id': ['https://www.wikidata.org/entity/MT2208', 'https://www.wikidata.org/entity/Q4465'], 'answer': ['Meet the Feebles', 'The Frighteners', 'Forgotten Silver', 'King Kong', 'Heavenly Creatures', 'Bad Taste', 'The Lovely Bones'], 'answer_id': ['https://www.wikidata.org/entity/Q1319155', 'https://www.wikidata.org/entity/Q1332274', 'https://www.wikidata.org/entity/Q1437321', 'https://www.wikidata.org/entity/Q160215', 'https://www.wikidata.org/entity/Q322206', 'https://www.wikidata.org/entity/Q605204', 'https://www.wikidata.org/entity/Q839123'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"has_tags\" . ?e1 rdfs:label \"peter jackson\" . ?rel2 rdfs:label \"written_by\" . ?e2 rdfs:label \"Peter Jackson\" . }'}, {'qid': 'mcqa-9274ab0e-e67e-11ee-a624-58961d663d9c', 'question': 'What movies did [Yusry bin Abdul Halim] direct that were filmed in the [Malay] language?', 'question_type': 'director_to_movie_constraint_language', 'topic_entity': ['Yusry bin Abdul Halim', 'Malay'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q12712786', 'https://www.wikidata.org/entity/Q9237'], 'answer': ['Cicak Man', 'Cicak Man 2: Planet Hitam', 'The Malay Chronicles: Bloodlines', 'Cicak Man 3'], 'answer_id': ['https://www.wikidata.org/entity/Q1015807', 'https://www.wikidata.org/entity/Q1015851', 'https://www.wikidata.org/entity/Q10968665', 'https://www.wikidata.org/entity/Q19798548'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?l  WHERE {     ?uri ?rel1 ?e1;     ?rel2 ?e2;     rdfs:label ?l.     ?rel1 rdfs:label \"directed_by\".     ?e1 rdfs:label \"Yusry bin Abdul Halim\".     ?rel2 rdfs:label \"in_language\".     ?e2 rdfs:label \"Malay\". }'}, {'qid': 'mcqa-9274ab0f-e67e-11ee-890f-58961d663d9c', 'question': 'what are the movies that have the tag [jacques tourneur] and are directed by the same director as [Berlin Express]?', 'question_type': 'movie_to_director_to_movie_constraint_tag', 'topic_entity': ['Berlin Express', 'jacques tourneur'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q821062', 'https://www.wikidata.org/entity/MT2904'], 'answer': ['Nightfall', 'The Flame and the Arrow', 'Out of the Past', 'Cat People', 'I Walked with a Zombie', 'The Leopard Man', 'Canyon Passage'], 'answer_id': ['https://www.wikidata.org/entity/Q1159969', 'https://www.wikidata.org/entity/Q1196413', 'https://www.wikidata.org/entity/Q1400390', 'https://www.wikidata.org/entity/Q1542184', 'https://www.wikidata.org/entity/Q1633356', 'https://www.wikidata.org/entity/Q2063033', 'https://www.wikidata.org/entity/Q522916'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"directed_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"Berlin Express\" . ?uri ?rel1 ?e2 ; ?rel4 ?e4 ; rdfs:label ?label . FILTER (?label != \"Berlin Express\") ?rel4 rdfs:label \"has_tags\" . ?e4 rdfs:label \"jacques tourneur\" . }'}, {'qid': 'mcqa-9274ab10-e67e-11ee-8752-58961d663d9c', 'question': \"I'd like to know which movies starred [Axel Mattsson] in [1917].\", 'question_type': 'actor_year_movie', 'topic_entity': ['Axel Mattsson', '1917'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q35983915'], 'answer': ['Pax aeterna'], 'answer_id': ['https://www.wikidata.org/entity/Q12331107'], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?movie ?movie_label WHERE {?e rdfs:label \"Axel Mattsson\". ?movie wd:P161 ?e; wd:publication_year \"1917\"; rdfs:label ?movie_label. }'}, {'qid': 'mcqa-9274ab11-e67e-11ee-bdc8-58961d663d9c', 'question': 'can you tell me which films have the same screenwriter as [It Came from Beneath the Sea] and were released in [1952]?', 'question_type': 'movie_to_writer_to_movie_constraint_year', 'topic_entity': ['It Came from Beneath the Sea', '1952'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q50937'], 'answer': ['This Woman Is Dangerous'], 'answer_id': ['https://www.wikidata.org/entity/Q1536916'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"It Came from Beneath the Sea\" . ?uri ?rel1 ?e2 ; ?rel4 \"1952\" ; rdfs:label ?label ; FILTER (?label != \"It Came from Beneath the Sea\") . ?rel4 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab12-e67e-11ee-b7f8-58961d663d9c', 'question': 'who was the screenwriter for the films directed by [Raymond Rouleau] and also wrote the screenplay for [Focus]?', 'question_type': 'director_to_movie_to_writer_constraint_movie', 'topic_entity': ['Raymond Rouleau', 'Focus'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q282588', 'https://www.wikidata.org/entity/Q1435058'], 'answer': ['Arthur Miller'], 'answer_id': ['https://www.wikidata.org/entity/Q80596'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?label  WHERE {     ?intermediate_ent_1 ?rel1 ?e1;     ?rel2 ?uri.     ?e2 ?rel3 ?uri.     ?uri rdfs:label ?label.     ?rel1 rdfs:label \"directed_by\".     ?e1 rdfs:label \"Raymond Rouleau\".     ?rel2 rdfs:label \"written_by\".     ?e2 rdfs:label \"Focus\".     ?rel2 rdfs:label \"written_by\".      }'}, {'qid': 'mcqa-9274ab13-e67e-11ee-9400-58961d663d9c', 'question': 'What are the performers in films directed by [Samuel Benchetrit] and released in [2011]?', 'question_type': 'director_year_movie', 'topic_entity': ['Samuel Benchetrit', '2011'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q970408'], 'answer': ['Ben Gazzara', 'Jalil Lespert', 'Adèle Exarchopoulos', 'Sergi López', 'Serge Larivière', 'Anna Mouglalis', 'Samuel Benchetrit', 'José Garcia', 'Martin Jobert', 'Fabrice Adde'], 'answer_id': ['https://www.wikidata.org/entity/Q296287', 'https://www.wikidata.org/entity/Q556578', 'https://www.wikidata.org/entity/Q2825427', 'https://www.wikidata.org/entity/Q543814', 'https://www.wikidata.org/entity/Q3479397', 'https://www.wikidata.org/entity/Q270146', 'https://www.wikidata.org/entity/Q970408', 'https://www.wikidata.org/entity/Q778451', 'https://www.wikidata.org/entity/Q3295476', 'https://www.wikidata.org/entity/Q3063805'], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?id ?actor WHERE {?dir rdfs:label \"Samuel Benchetrit\". ?movie wd:P57 ?dir; wd:publication_year \"2011\"; wd:P161 ?id. ?id rdfs:label ?actor. }'}, {'qid': 'mcqa-9274ab14-e67e-11ee-b40c-58961d663d9c', 'question': 'Can you inform me about the films in which [William Turner] is the writer and [Dave Fleischer] is the director?', 'question_type': 'writer_director_movie', 'topic_entity': ['William Turner', 'Dave Fleischer'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q66828232', 'https://www.wikidata.org/entity/Q1173200'], 'answer': [\"You Can't Shoe a Horse Fly\", 'Mr. Bug Goes to Town'], 'answer_id': ['https://www.wikidata.org/entity/Q110178974', 'https://www.wikidata.org/entity/Q2061614'], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?movie ?movie_label WHERE {?movie wd:P58 ?e1 ; wd:P57 ?e2 ; rdfs:label ?movie_label. ?e1 rdfs:label \"William Turner\". ?e2 rdfs:label \"Dave Fleischer\". }'}, {'qid': 'mcqa-9274ab15-e67e-11ee-b190-58961d663d9c', 'question': \"I'm wondering what movies [Atul Kale] acted in that were in [English].\", 'question_type': 'actor_to_movie_constraint_language', 'topic_entity': ['Atul Kale', 'English'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q4818781', 'https://www.wikidata.org/entity/Q1860'], 'answer': ['The Second Best Exotic Marigold Hotel'], 'answer_id': ['https://www.wikidata.org/entity/Q16203908'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?l  WHERE {     ?uri ?rel1 ?e1;     ?rel2 ?e2;     rdfs:label ?l.     ?rel1 rdfs:label \"starred_actors\".     ?e1 rdfs:label \"Atul Kale\".     ?rel2 rdfs:label \"in_language\".     ?e2 rdfs:label \"English\". }'}, {'qid': 'mcqa-9274ab16-e67e-11ee-a0e3-58961d663d9c', 'question': 'Could you inform me how many movies [Dickie Moore] worked on in [1930]?', 'question_type': 'actor_year_num_movies', 'topic_entity': ['Dickie Moore', '1930'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1210022'], 'answer': ['5'], 'answer_id': [], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <https://www.wikidata.org/entity/> SELECT (COUNT(?movie) AS ?count) WHERE { ?movie wd:P161 ?actor . ?actor rdfs:label \"Dickie Moore\". ?movie wd:publication_year \"1930\" . }'}, {'qid': 'mcqa-9274ab17-e67e-11ee-8e43-58961d663d9c', 'question': 'do you have a list of movies that were directed by the same director as [Plenty] and released in [2001]?', 'question_type': 'movie_to_director_to_movie_constraint_year', 'topic_entity': ['Plenty', '2001'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1545013'], 'answer': ['Last Orders'], 'answer_id': ['https://www.wikidata.org/entity/Q3423109'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"directed_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"Plenty\" . ?uri ?rel1 ?e2 ; ?rel4 \"2001\" ; rdfs:label ?label ; FILTER (?label != \"Plenty\") . ?rel4 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab18-e67e-11ee-94fe-58961d663d9c', 'question': 'What was the name of the film that [Waris Hussein] directed and [Perry King] acted in?', 'question_type': 'director_to_movie_constraint_actor', 'topic_entity': ['Waris Hussein', 'Perry King'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q2570928', 'https://www.wikidata.org/entity/Q1334740'], 'answer': ['The Possession of Joel Delaney'], 'answer_id': ['https://www.wikidata.org/entity/Q3399700'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"directed_by\" . ?e1 rdfs:label \"Waris Hussein\" . ?rel2 rdfs:label \"starred_actors\" . ?e2 rdfs:label \"Perry King\" . }'}, {'qid': 'mcqa-9274ab19-e67e-11ee-a794-58961d663d9c', 'question': \"I'd like to know which films by [Stanley Kubrick] didn't have [Paul Farrell] in them.\", 'question_type': 'director_movie_not_actor', 'topic_entity': ['Stanley Kubrick', 'Paul Farrell'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q2001', 'https://www.wikidata.org/entity/Q4842476'], 'answer': ['2001: A Space Odyssey', 'Dr. Strangelove', 'Spartacus', 'Flying Padre', 'The Shining', 'Eyes Wide Shut', 'The Seafarers', 'Full Metal Jacket', 'Day of the Fight', 'Barry Lyndon', 'Lolita', 'The Killing', 'Paths of Glory', 'Fear and Desire', \"Killer's Kiss\"], 'answer_id': ['https://www.wikidata.org/entity/Q103474', 'https://www.wikidata.org/entity/Q105702', 'https://www.wikidata.org/entity/Q108297', 'https://www.wikidata.org/entity/Q1434632', 'https://www.wikidata.org/entity/Q186341', 'https://www.wikidata.org/entity/Q209481', 'https://www.wikidata.org/entity/Q2164458', 'https://www.wikidata.org/entity/Q243439', 'https://www.wikidata.org/entity/Q426628', 'https://www.wikidata.org/entity/Q471716', 'https://www.wikidata.org/entity/Q536560', 'https://www.wikidata.org/entity/Q592072', 'https://www.wikidata.org/entity/Q747936', 'https://www.wikidata.org/entity/Q929157', 'https://www.wikidata.org/entity/Q936477'], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?movie ?movie_label WHERE {?movie wd:P57 ?e1; rdfs:label ?movie_label. ?e1 rdfs:label \"Stanley Kubrick\" . MINUS { ?movie wd:P161 ?e2. ?e2 rdfs:label \"Paul Farrell\" . } }'}, {'qid': 'mcqa-9274ab1a-e67e-11ee-bba0-58961d663d9c', 'question': 'which films share the same screenwriter as [The Story of Esther Costello] and are tagged [troma]?', 'question_type': 'movie_to_writer_to_movie_constraint_tag', 'topic_entity': ['The Story of Esther Costello', 'troma'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q838064', 'https://www.wikidata.org/entity/MT683'], 'answer': [\"Mother's Day\"], 'answer_id': ['https://www.wikidata.org/entity/Q1409395'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"The Story of Esther Costello\" . ?uri ?rel1 ?e2 ; ?rel4 ?e4 ; rdfs:label ?label . FILTER (?label != \"The Story of Esther Costello\") ?rel4 rdfs:label \"has_tags\" . ?e4 rdfs:label \"troma\" . }'}, {'qid': 'mcqa-9274ab1b-e67e-11ee-8341-58961d663d9c', 'question': 'what are the films that have the same actor as [Victim] and have the tag [dirk bogarde]?', 'question_type': 'movie_to_actor_to_movie_constraint_tag', 'topic_entity': ['Victim', 'dirk bogarde'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q2747218', 'https://www.wikidata.org/entity/Q3523221', 'https://www.wikidata.org/entity/Q7925578', 'https://www.wikidata.org/entity/MT3030'], 'answer': ['The Servant', 'Death in Venice'], 'answer_id': ['https://www.wikidata.org/entity/Q2264443', 'https://www.wikidata.org/entity/Q742308'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"starred_actors\" . ?e1 ?rel1 ?e2 ; rdfs:label \"Victim\" . ?uri ?rel1 ?e2 ; ?rel4 ?e4 ; rdfs:label ?label . FILTER (?label != \"Victim\") ?rel4 rdfs:label \"has_tags\" . ?e4 rdfs:label \"dirk bogarde\" . }'}, {'qid': 'mcqa-9274ab1c-e67e-11ee-a20c-58961d663d9c', 'question': 'Which films did [Paul Feig] direct that would be commonly seen as [comedy]?', 'question_type': 'director_to_movie_constraint_tag', 'topic_entity': ['Paul Feig', 'comedy'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q2031292', 'https://www.wikidata.org/entity/Q40831', 'https://www.wikidata.org/entity/Q5151421', 'https://www.wikidata.org/entity/MT72'], 'answer': ['Bridesmaids'], 'answer_id': ['https://www.wikidata.org/entity/Q837264'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"directed_by\" . ?e1 rdfs:label \"Paul Feig\" . ?rel2 rdfs:label \"has_tags\" . ?e2 rdfs:label \"comedy\" . }'}, {'qid': 'mcqa-9274ab1d-e67e-11ee-996c-58961d663d9c', 'question': 'who wrote films alongside [John Musker] and also wrote for [The Little Mermaid]?', 'question_type': 'writer_to_movie_to_writer_constraint_movie', 'topic_entity': ['John Musker', 'The Little Mermaid'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q735440', 'https://www.wikidata.org/entity/Q1219608', 'https://www.wikidata.org/entity/Q14857809', 'https://www.wikidata.org/entity/Q190135', 'https://www.wikidata.org/entity/Q28970981', 'https://www.wikidata.org/entity/Q4400248', 'https://www.wikidata.org/entity/Q7747661', 'https://www.wikidata.org/entity/Q944287'], 'answer': ['Ron Clements', 'Howard Ashman', 'Hans Christian Andersen'], 'answer_id': ['https://www.wikidata.org/entity/Q930209', 'https://www.wikidata.org/entity/Q1334295', 'https://www.wikidata.org/entity/Q146141'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\". ?e1 rdfs:label \"John Musker\" . ?rel2 rdfs:label \"written_by\" . ?e2 ?rel1 ?e1 ; ?rel2 ?uri . ?uri rdfs:label ?label . FILTER (?label != \"John Musker\") ?rel4 rdfs:label \"written_by\" . ?e4 ?rel4 ?uri ; rdfs:label \"The Little Mermaid\" . }'}, {'qid': 'mcqa-9274ab1e-e67e-11ee-a31f-58961d663d9c', 'question': 'who are the actors in the films written by [William Richert] and also acted in [The Mirror Has Two Faces]?', 'question_type': 'writer_to_movie_to_actor_constraint_movie', 'topic_entity': ['William Richert', 'The Mirror Has Two Faces'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q8017559', 'https://www.wikidata.org/entity/Q1538804'], 'answer': ['Jeff Bridges'], 'answer_id': ['https://www.wikidata.org/entity/Q174843'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\". ?e1 rdfs:label \"William Richert\" . ?rel2 rdfs:label \"starred_actors\" . ?e2 ?rel1 ?e1 ; ?rel2 ?uri . ?uri rdfs:label ?label . FILTER (?label != \"William Richert\") ?rel4 rdfs:label \"starred_actors\" . ?e4 ?rel4 ?uri ; rdfs:label \"The Mirror Has Two Faces\" . }'}, {'qid': 'mcqa-9274ab1f-e67e-11ee-825f-58961d663d9c', 'question': 'For which movie was [Justin Lin] the director and [Chris Morgan] the writer?', 'question_type': 'director_to_movie_constraint_writer', 'topic_entity': ['Justin Lin', 'Chris Morgan'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q551876', 'https://www.wikidata.org/entity/Q5107501'], 'answer': ['The Fast and the Furious: Tokyo Drift', 'F9', 'Fast & Furious', 'Fast Five', 'Fast & Furious 6'], 'answer_id': ['https://www.wikidata.org/entity/Q213208', 'https://www.wikidata.org/entity/Q29466808', 'https://www.wikidata.org/entity/Q380996', 'https://www.wikidata.org/entity/Q401976', 'https://www.wikidata.org/entity/Q5516100'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"directed_by\" . ?e1 rdfs:label \"Justin Lin\" . ?rel2 rdfs:label \"written_by\" . ?e2 rdfs:label \"Chris Morgan\" . }'}, {'qid': 'mcqa-9274ab20-e67e-11ee-8cfd-58961d663d9c', 'question': 'Who wrote the screenplay for [The Amazing Dr. Clitterhouse] and also wrote for [The Maltese Falcon]?', 'question_type': 'movie_to_writer_constraint_movie', 'topic_entity': ['The Amazing Dr. Clitterhouse', 'The Maltese Falcon'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1167550', 'https://www.wikidata.org/entity/Q221462', 'https://www.wikidata.org/entity/Q74315'], 'answer': ['John Huston'], 'answer_id': ['https://www.wikidata.org/entity/Q51575'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?e1 ?rel ?uri; rdfs:label \"The Amazing Dr. Clitterhouse\" . ?e3 ?rel ?uri; rdfs:label \"The Maltese Falcon\" . ?rel rdfs:label \"written_by\" . ?uri rdfs:label ?label . }'}, {'qid': 'mcqa-9274ab21-e67e-11ee-94db-58961d663d9c', 'question': 'What are movies about [linda fiorentino] and [angels]?', 'question_type': 'tag_to_movie_constraint_tag', 'topic_entity': ['angels', 'linda fiorentino'], 'topic_entity_id': ['https://www.wikidata.org/entity/MT404', 'https://www.wikidata.org/entity/MT1916'], 'answer': ['Dogma'], 'answer_id': ['https://www.wikidata.org/entity/Q40187'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"has_tags\" . ?e1 rdfs:label \"angels\" . ?rel2 rdfs:label \"has_tags\" . ?e2 rdfs:label \"linda fiorentino\" . }'}, {'qid': 'mcqa-9274ab22-e67e-11ee-9962-58961d663d9c', 'question': 'Could you list the films that [Karl Freund] directed in [1935]?', 'question_type': 'director_to_movie_constraint_year', 'topic_entity': ['Karl Freund', '1935'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q62099'], 'answer': ['Mad Love'], 'answer_id': ['https://www.wikidata.org/entity/Q1426803'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 \"1935\" ; rdfs:label ?label . ?rel1 rdfs:label \"directed_by\" . ?e1 rdfs:label \"Karl Freund\" . ?rel2 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab23-e67e-11ee-ab77-58961d663d9c', 'question': 'What movies did [Stephen J. Cannell] write that have a genre of [comedy film]?', 'question_type': 'writer_to_movie_constraint_genre', 'topic_entity': ['Stephen J. Cannell', 'comedy film'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q470282', 'https://www.wikidata.org/entity/Q157443'], 'answer': ['22 Jump Street', '21 Jump Street'], 'answer_id': ['https://www.wikidata.org/entity/Q15040917', 'https://www.wikidata.org/entity/Q214014'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"written_by\" . ?e1 rdfs:label \"Stephen J. Cannell\" . ?rel2 rdfs:label \"has_genre\" . ?e2 rdfs:label \"comedy film\" . }'}, {'qid': 'mcqa-9274ab24-e67e-11ee-b673-58961d663d9c', 'question': 'what are the films directed by the same director as [Lucy], and written by [Larry Gelbart]?', 'question_type': 'movie_to_director_to_movie_constraint_writer', 'topic_entity': ['Lucy', 'Larry Gelbart'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q15624215', 'https://www.wikidata.org/entity/Q1873753', 'https://www.wikidata.org/entity/Q6698156', 'https://www.wikidata.org/entity/Q1806065'], 'answer': ['Barbarians at the Gate'], 'answer_id': ['https://www.wikidata.org/entity/Q4103652'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"directed_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"Lucy\" . ?uri ?rel1 ?e2 ; ?rel4 ?e4 ; rdfs:label ?label . FILTER (?label != \"Lucy\") ?rel4 rdfs:label \"written_by\" . ?e4 rdfs:label \"Larry Gelbart\" . }'}, {'qid': 'mcqa-9274ab25-e67e-11ee-8eb9-58961d663d9c', 'question': 'Can you name any [English] movies that would fit the [agent] genre?', 'question_type': 'tag_to_movie_constraint_language', 'topic_entity': ['agent', 'English'], 'topic_entity_id': ['https://www.wikidata.org/entity/MT3458', 'https://www.wikidata.org/entity/Q1860'], 'answer': ['Thunderball', 'Paul', 'Jerry Maguire'], 'answer_id': ['https://www.wikidata.org/entity/Q107724', 'https://www.wikidata.org/entity/Q1164753', 'https://www.wikidata.org/entity/Q329131'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?l  WHERE {     ?uri ?rel1 ?e1;     ?rel2 ?e2;     rdfs:label ?l.     ?rel1 rdfs:label \"has_tags\".     ?e1 rdfs:label \"agent\".     ?rel2 rdfs:label \"in_language\".     ?e2 rdfs:label \"English\". }'}, {'qid': 'mcqa-9274ab26-e67e-11ee-afbd-58961d663d9c', 'question': 'Can you tell me if [Jacobo Timerman: Prisoner Without a Name, Cell Without a Number] had its debut in [1989]?', 'question_type': 'yesno_movie_year', 'topic_entity': ['Jacobo Timerman: Prisoner Without a Name, Cell Without a Number', '1989'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q19580410'], 'answer': ['NO'], 'answer_id': [], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK { ?movie rdfs:label \"Jacobo Timerman: Prisoner Without a Name, Cell Without a Number\" . ?movie wd:publication_year \"1989\" . }'}, {'qid': 'mcqa-9274ab27-e67e-11ee-a0d5-58961d663d9c', 'question': 'Can you tell me about any movies [Harold Ramis] starred in that fall under the genre of [comedy film]?', 'question_type': 'actor_to_movie_constraint_genre', 'topic_entity': ['Harold Ramis', 'comedy film'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q286890', 'https://www.wikidata.org/entity/Q157443'], 'answer': ['Ghostbusters', 'The Last Kiss', \"National Lampoon's Vacation\", 'High Fidelity', 'Drunk Stoned Brilliant Dead', 'As Good as It Gets', 'Airheads', 'Groundhog Day', 'Ghostbusters II', 'Orange County'], 'answer_id': ['https://www.wikidata.org/entity/Q108745', 'https://www.wikidata.org/entity/Q1199381', 'https://www.wikidata.org/entity/Q1219310', 'https://www.wikidata.org/entity/Q1473804', 'https://www.wikidata.org/entity/Q19824637', 'https://www.wikidata.org/entity/Q221594', 'https://www.wikidata.org/entity/Q408725', 'https://www.wikidata.org/entity/Q488655', 'https://www.wikidata.org/entity/Q492214', 'https://www.wikidata.org/entity/Q913965'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"starred_actors\" . ?e1 rdfs:label \"Harold Ramis\" . ?rel2 rdfs:label \"has_genre\" . ?e2 rdfs:label \"comedy film\" . }'}, {'qid': 'mcqa-9274ab28-e67e-11ee-9bfa-58961d663d9c', 'question': 'Which are the common tags of [The Trespasser] and [The Song of Bernadette]?', 'question_type': 'movie_to_tag_constraint_movie', 'topic_entity': ['The Trespasser', 'The Song of Bernadette'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q10339275', 'https://www.wikidata.org/entity/Q1716646', 'https://www.wikidata.org/entity/Q21528145', 'https://www.wikidata.org/entity/Q3819394', 'https://www.wikidata.org/entity/Q669749'], 'answer': ['bd-r'], 'answer_id': ['https://www.wikidata.org/entity/MT3'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?e1 ?rel ?uri; rdfs:label \"The Trespasser\" . ?e3 ?rel ?uri; rdfs:label \"The Song of Bernadette\" . ?rel rdfs:label \"has_tags\" . ?uri rdfs:label ?label . }'}, {'qid': 'mcqa-9274ab29-e67e-11ee-be8a-58961d663d9c', 'question': 'What movies in [1986] starred [Tom Waits]?', 'question_type': 'actor_to_movie_constraint_year', 'topic_entity': ['Tom Waits', '1986'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q184805', 'https://www.wikidata.org/entity/Q30939595'], 'answer': ['Down by Law'], 'answer_id': ['https://www.wikidata.org/entity/Q192409'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 \"1986\" ; rdfs:label ?label . ?rel1 rdfs:label \"starred_actors\" . ?e1 rdfs:label \"Tom Waits\" . ?rel2 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab2a-e67e-11ee-9299-58961d663d9c', 'question': 'Which movies did [Roy Del Ruth] direct that were tagged under [james cagney]?', 'question_type': 'director_to_movie_constraint_tag', 'topic_entity': ['Roy Del Ruth', 'james cagney'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q918762', 'https://www.wikidata.org/entity/MT349'], 'answer': ['Lady Killer', 'The West Point Story'], 'answer_id': ['https://www.wikidata.org/entity/Q1193526', 'https://www.wikidata.org/entity/Q2104178'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"directed_by\" . ?e1 rdfs:label \"Roy Del Ruth\" . ?rel2 rdfs:label \"has_tags\" . ?e2 rdfs:label \"james cagney\" . }'}, {'qid': 'mcqa-9274ab2b-e67e-11ee-8b69-58961d663d9c', 'question': '[Majid Majidi] wrote the story for a [Persian] movie - which one?', 'question_type': 'writer_to_movie_constraint_language', 'topic_entity': ['Majid Majidi', 'Persian'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q81770', 'https://www.wikidata.org/entity/Q9168'], 'answer': ['The Song of Sparrows', 'Pedar', 'Children of Heaven', 'Baduk', 'Barefoot to Herat', 'Muhammad: The Messenger of God', 'The Willow Tree', 'Baran', 'The Color of Paradise', 'The Sun'], 'answer_id': ['https://www.wikidata.org/entity/Q1169658', 'https://www.wikidata.org/entity/Q119704', 'https://www.wikidata.org/entity/Q339804', 'https://www.wikidata.org/entity/Q4841166', 'https://www.wikidata.org/entity/Q4860366', 'https://www.wikidata.org/entity/Q5957665', 'https://www.wikidata.org/entity/Q7775009', 'https://www.wikidata.org/entity/Q80409', 'https://www.wikidata.org/entity/Q80608', 'https://www.wikidata.org/entity/Q85970010'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?l  WHERE {     ?uri ?rel1 ?e1;     ?rel2 ?e2;     rdfs:label ?l.     ?rel1 rdfs:label \"written_by\".     ?e1 rdfs:label \"Majid Majidi\".     ?rel2 rdfs:label \"in_language\".     ?e2 rdfs:label \"Persian\". }'}, {'qid': 'mcqa-9274ab2c-e67e-11ee-9ef3-58961d663d9c', 'question': 'Can you inform me about the number of movies directed by [Charles Raymond]?', 'question_type': 'director_num_movies', 'topic_entity': ['Charles Raymond'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q3666583'], 'answer': ['8'], 'answer_id': [], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT (COUNT(?movie) AS ?count) WHERE { ?movie wd:P57 ?director. ?director rdfs:label \"Charles Raymond\" . }'}, {'qid': 'mcqa-9274ab2d-e67e-11ee-b48e-58961d663d9c', 'question': 'do you by any chance know which films have the same director as [Murmur of the Heart] and were released in [1965]?', 'question_type': 'movie_to_director_to_movie_constraint_year', 'topic_entity': ['Murmur of the Heart', '1965'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q686059', 'https://www.wikidata.org/entity/Q20751307'], 'answer': ['Viva Maria!'], 'answer_id': ['https://www.wikidata.org/entity/Q1077152'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"directed_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"Murmur of the Heart\" . ?uri ?rel1 ?e2 ; ?rel4 \"1965\" ; rdfs:label ?label ; FILTER (?label != \"Murmur of the Heart\") . ?rel4 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab2e-e67e-11ee-9ace-58961d663d9c', 'question': '[Geraldine Page] starred in what films in [1966]?', 'question_type': 'actor_to_movie_constraint_year', 'topic_entity': ['Geraldine Page', '1966'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q228650'], 'answer': ['The Three Sisters', \"You're a Big Boy Now\"], 'answer_id': ['https://www.wikidata.org/entity/Q12005947', 'https://www.wikidata.org/entity/Q858584'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 \"1966\" ; rdfs:label ?label . ?rel1 rdfs:label \"starred_actors\" . ?e1 rdfs:label \"Geraldine Page\" . ?rel2 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab2f-e67e-11ee-8243-58961d663d9c', 'question': 'which film has the same screenwriter as [The Gingerbread Man] that starred [Gene Hackman]?', 'question_type': 'movie_to_writer_to_movie_constraint_actor', 'topic_entity': ['The Gingerbread Man', 'Gene Hackman'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1469084', 'https://www.wikidata.org/entity/Q150943'], 'answer': ['The Chamber', 'Runaway Jury', 'The Firm'], 'answer_id': ['https://www.wikidata.org/entity/Q1213747', 'https://www.wikidata.org/entity/Q151870', 'https://www.wikidata.org/entity/Q821692'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"The Gingerbread Man\" . ?uri ?rel1 ?e2 ; ?rel4 ?e4 ; rdfs:label ?label . FILTER (?label != \"The Gingerbread Man\") ?rel4 rdfs:label \"starred_actors\" . ?e4 rdfs:label \"Gene Hackman\" . }'}, {'qid': 'mcqa-9274ab30-e67e-11ee-82aa-58961d663d9c', 'question': 'What movies were written by [Franz Kafka] in [1962]?', 'question_type': 'writer_to_movie_constraint_year', 'topic_entity': ['Franz Kafka', '1962'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q905'], 'answer': ['The Trial'], 'answer_id': ['https://www.wikidata.org/entity/Q822426'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 \"1962\" ; rdfs:label ?label . ?rel1 rdfs:label \"written_by\" . ?e1 rdfs:label \"Franz Kafka\" . ?rel2 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab31-e67e-11ee-bfaa-58961d663d9c', 'question': \"Tell me if there's any record of [Adam Gertler] in [Enkeyo Ketta Kural].\", 'question_type': 'yesno_actor_movie', 'topic_entity': ['Adam Gertler', 'Enkeyo Ketta Kural'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q4679106', 'https://www.wikidata.org/entity/Q5379026'], 'answer': ['NO'], 'answer_id': [], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK { ?actor rdfs:label \"Adam Gertler\". ?movie wd:P161 ?actor ; rdfs:label \"Enkeyo Ketta Kural\" . }'}, {'qid': 'mcqa-9274ab32-e67e-11ee-a7a2-58961d663d9c', 'question': 'For which film did [Nicholas Ray] write the story and [Ida Lupino] direct it?', 'question_type': 'writer_to_movie_constraint_director', 'topic_entity': ['Nicholas Ray', 'Ida Lupino'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q240677', 'https://www.wikidata.org/entity/Q148669'], 'answer': ['On Dangerous Ground'], 'answer_id': ['https://www.wikidata.org/entity/Q1634259'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"written_by\" . ?e1 rdfs:label \"Nicholas Ray\" . ?rel2 rdfs:label \"directed_by\" . ?e2 rdfs:label \"Ida Lupino\" . }'}, {'qid': 'mcqa-9274ab33-e67e-11ee-95b4-58961d663d9c', 'question': 'can you think of any films that share the same actor as [Carry On Maratha] and are in [Marathi]?', 'question_type': 'movie_to_actor_to_movie_constraint_language', 'topic_entity': ['Carry On Maratha', 'Marathi'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q20720594', 'https://www.wikidata.org/entity/Q1571'], 'answer': ['Bonus', 'Deool Band', 'Kanha'], 'answer_id': ['https://www.wikidata.org/entity/Q107115537', 'https://www.wikidata.org/entity/Q20751315', 'https://www.wikidata.org/entity/Q27964451'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?label  WHERE {      ?e1 ?rel1 ?intermediate_ent_1.          ?uri ?rel2 ?intermediate_ent_1;     ?rel3 ?e2;     rdfs:label ?label.          ?e1 rdfs:label \"Carry On Maratha\".     ?rel1 rdfs:label \"starred_actors\".     ?rel2 rdfs:label \"starred_actors\".     ?rel3 rdfs:label \"in_language\".     ?e2 rdfs:label \"Marathi\".      }'}, {'qid': 'mcqa-9274ab34-e67e-11ee-9947-58961d663d9c', 'question': 'which actors were in both films directed by [Peter Mullan] and [Orphans]?', 'question_type': 'director_to_movie_to_actor_constraint_movie', 'topic_entity': ['Peter Mullan', 'Orphans'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q430804', 'https://www.wikidata.org/entity/Q3232338', 'https://www.wikidata.org/entity/Q3356639'], 'answer': ['Douglas Henshall', 'Gary Lewis'], 'answer_id': ['https://www.wikidata.org/entity/Q722061', 'https://www.wikidata.org/entity/Q1207418'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"directed_by\". ?e1 rdfs:label \"Peter Mullan\" . ?rel2 rdfs:label \"starred_actors\" . ?e2 ?rel1 ?e1 ; ?rel2 ?uri . ?uri rdfs:label ?label . FILTER (?label != \"Peter Mullan\") ?rel4 rdfs:label \"starred_actors\" . ?e4 ?rel4 ?uri ; rdfs:label \"Orphans\" . }'}, {'qid': 'mcqa-9274ab35-e67e-11ee-a2d1-58961d663d9c', 'question': 'Can you tell me how many films [Dhimitër Anagnosti] has directed?', 'question_type': 'director_num_movies', 'topic_entity': ['Dhimitër Anagnosti'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q3025717'], 'answer': ['14'], 'answer_id': [], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT (COUNT(?movie) AS ?count) WHERE { ?movie wd:P57 ?director. ?director rdfs:label \"Dhimitër Anagnosti\" . }'}, {'qid': 'mcqa-9274ab36-e67e-11ee-a991-58961d663d9c', 'question': 'Who is the screenwriter of [The Last Time I Saw Paris] and also [The Last Tycoon]?', 'question_type': 'movie_to_writer_constraint_movie', 'topic_entity': ['The Last Time I Saw Paris', 'The Last Tycoon'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1158191', 'https://www.wikidata.org/entity/Q1199439', 'https://www.wikidata.org/entity/Q25352462', 'https://www.wikidata.org/entity/Q2782486'], 'answer': ['F. Scott Fitzgerald'], 'answer_id': ['https://www.wikidata.org/entity/Q93354'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?e1 ?rel ?uri; rdfs:label \"The Last Time I Saw Paris\" . ?e3 ?rel ?uri; rdfs:label \"The Last Tycoon\" . ?rel rdfs:label \"written_by\" . ?uri rdfs:label ?label . }'}, {'qid': 'mcqa-9274ab37-e67e-11ee-a98f-58961d663d9c', 'question': 'who wrote the films that [Frank Hvam] starred in, as well as [Klown]?', 'question_type': 'actor_to_movie_to_writer_constraint_movie', 'topic_entity': ['Frank Hvam', 'Klown'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q3362230', 'https://www.wikidata.org/entity/Q1758576'], 'answer': ['Casper Christensen', 'Mikkel Nørgaard'], 'answer_id': ['https://www.wikidata.org/entity/Q3362157', 'https://www.wikidata.org/entity/Q12327179'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"starred_actors\". ?e1 rdfs:label \"Frank Hvam\" . ?rel2 rdfs:label \"written_by\" . ?e2 ?rel1 ?e1 ; ?rel2 ?uri . ?uri rdfs:label ?label . FILTER (?label != \"Frank Hvam\") ?rel4 rdfs:label \"written_by\" . ?e4 ?rel4 ?uri ; rdfs:label \"Klown\" . }'}, {'qid': 'mcqa-9274ab38-e67e-11ee-8901-58961d663d9c', 'question': 'Could you tell me who wrote the screenplay for [The Parent Trap] and also wrote for [How to Succeed in Business Without Really Trying]?', 'question_type': 'movie_to_writer_constraint_movie', 'topic_entity': ['The Parent Trap', 'How to Succeed in Business Without Really Trying'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1217234', 'https://www.wikidata.org/entity/Q729782', 'https://www.wikidata.org/entity/Q1037371'], 'answer': ['David Swift'], 'answer_id': ['https://www.wikidata.org/entity/Q3018855'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?e1 ?rel ?uri; rdfs:label \"The Parent Trap\" . ?e3 ?rel ?uri; rdfs:label \"How to Succeed in Business Without Really Trying\" . ?rel rdfs:label \"written_by\" . ?uri rdfs:label ?label . }'}, {'qid': 'mcqa-9274ab39-e67e-11ee-b028-58961d663d9c', 'question': 'what movies did the director of [In His Hands] also make, and did [Fanny Ardant] star in them?', 'question_type': 'movie_to_director_to_movie_constraint_actor', 'topic_entity': ['In His Hands', 'Fanny Ardant'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q3055215', 'https://www.wikidata.org/entity/Q106349'], 'answer': ['Nathalie...', 'Augustin, King of Kung-Fu'], 'answer_id': ['https://www.wikidata.org/entity/Q151737', 'https://www.wikidata.org/entity/Q767502'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"directed_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"In His Hands\" . ?uri ?rel1 ?e2 ; ?rel4 ?e4 ; rdfs:label ?label . FILTER (?label != \"In His Hands\") ?rel4 rdfs:label \"starred_actors\" . ?e4 rdfs:label \"Fanny Ardant\" . }'}, {'qid': 'mcqa-9274ab3a-e67e-11ee-8ebd-58961d663d9c', 'question': 'What are the movies written by [Peter Straughan] and [John le Carré]?', 'question_type': 'writer_to_movie_constraint_writer', 'topic_entity': ['Peter Straughan', 'John le Carré'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q7177144', 'https://www.wikidata.org/entity/Q209641'], 'answer': ['Tinker Tailor Soldier Spy'], 'answer_id': ['https://www.wikidata.org/entity/Q681962'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"written_by\" . ?e1 rdfs:label \"Peter Straughan\" . ?rel2 rdfs:label \"written_by\" . ?e2 rdfs:label \"John le Carré\" . }'}, {'qid': 'mcqa-9274ab3b-e67e-11ee-b5a3-58961d663d9c', 'question': 'what are the films that share an actor with [Replicant] and are directed by [George A. Romero]?', 'question_type': 'movie_to_actor_to_movie_constraint_director', 'topic_entity': ['Replicant', 'George A. Romero'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q543573', 'https://www.wikidata.org/entity/Q51511'], 'answer': ['The Dark Half'], 'answer_id': ['https://www.wikidata.org/entity/Q940066'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"starred_actors\" . ?e1 ?rel1 ?e2 ; rdfs:label \"Replicant\" . ?uri ?rel1 ?e2 ; ?rel4 ?e4 ; rdfs:label ?label . FILTER (?label != \"Replicant\") ?rel4 rdfs:label \"directed_by\" . ?e4 rdfs:label \"George A. Romero\" . }'}, {'qid': 'mcqa-9274ab3c-e67e-11ee-a062-58961d663d9c', 'question': 'which of the screenwriters of the [André de Toth] directed film wrote the screenplay for [A Night of Adventure]?', 'question_type': 'director_to_movie_to_writer_constraint_movie', 'topic_entity': ['André de Toth', 'A Night of Adventure'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q518244', 'https://www.wikidata.org/entity/Q15378692'], 'answer': ['Crane Wilbur'], 'answer_id': ['https://www.wikidata.org/entity/Q3002119'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?label  WHERE {     ?intermediate_ent_1 ?rel1 ?e1;     ?rel2 ?uri.     ?e2 ?rel3 ?uri.     ?uri rdfs:label ?label.     ?rel1 rdfs:label \"directed_by\".     ?e1 rdfs:label \"André de Toth\".     ?rel2 rdfs:label \"written_by\".     ?e2 rdfs:label \"A Night of Adventure\".     ?rel2 rdfs:label \"written_by\".      }'}, {'qid': 'mcqa-9274ab3d-e67e-11ee-9cbf-58961d663d9c', 'question': 'which films have the same screenwriter as [Paris When It Sizzles] and are categorised as [mystery film]?', 'question_type': 'movie_to_writer_to_movie_constraint_genre', 'topic_entity': ['Paris When It Sizzles', 'mystery film'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q2275081', 'https://www.wikidata.org/entity/Q1200678'], 'answer': ['The Lady Vanishes'], 'answer_id': ['https://www.wikidata.org/entity/Q1058723'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"Paris When It Sizzles\" . ?uri ?rel1 ?e2 ; ?rel4 ?e4 ; rdfs:label ?label . FILTER (?label != \"Paris When It Sizzles\") ?rel4 rdfs:label \"has_genre\" . ?e4 rdfs:label \"mystery film\" . }'}, {'qid': 'mcqa-9274ab3e-e67e-11ee-9aae-58961d663d9c', 'question': 'do you know of any [English] language movies that have the same actor as [Blood Lake]?', 'question_type': 'movie_to_actor_to_movie_constraint_language', 'topic_entity': ['Blood Lake', 'English'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q4927629', 'https://www.wikidata.org/entity/Q1860'], 'answer': ['Not Married With Children XXX', 'Marriage 2.0', 'Magic Mike XXXL: A Hardcore Parody', 'An Open Invitation: A Real Swingers Party in San Francisco', 'The Sexual Liberation of Anna Lee'], 'answer_id': ['https://www.wikidata.org/entity/Q2001708', 'https://www.wikidata.org/entity/Q20058643', 'https://www.wikidata.org/entity/Q22249836', 'https://www.wikidata.org/entity/Q3614835', 'https://www.wikidata.org/entity/Q98168313'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?label  WHERE {      ?e1 ?rel1 ?intermediate_ent_1.          ?uri ?rel2 ?intermediate_ent_1;     ?rel3 ?e2;     rdfs:label ?label.          ?e1 rdfs:label \"Blood Lake\".     ?rel1 rdfs:label \"starred_actors\".     ?rel2 rdfs:label \"starred_actors\".     ?rel3 rdfs:label \"in_language\".     ?e2 rdfs:label \"English\".      }'}, {'qid': 'mcqa-9274ab3f-e67e-11ee-8e47-58961d663d9c', 'question': '[Fay Wray] stars in what films that is classified as [comedy film]?', 'question_type': 'actor_to_movie_constraint_genre', 'topic_entity': ['Fay Wray', 'comedy film'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q266694', 'https://www.wikidata.org/entity/Q157443'], 'answer': ['The Stolen Jools', 'The Countess of Monte Cristo', 'Roaming Lady', 'Cheating Cheaters', 'Murder by Death', 'Chasing the Chaser'], 'answer_id': ['https://www.wikidata.org/entity/Q1544930', 'https://www.wikidata.org/entity/Q20649628', 'https://www.wikidata.org/entity/Q20814722', 'https://www.wikidata.org/entity/Q22079358', 'https://www.wikidata.org/entity/Q288098', 'https://www.wikidata.org/entity/Q2961334'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"starred_actors\" . ?e1 rdfs:label \"Fay Wray\" . ?rel2 rdfs:label \"has_genre\" . ?e2 rdfs:label \"comedy film\" . }'}, {'qid': 'mcqa-9274ab40-e67e-11ee-beef-58961d663d9c', 'question': 'Tell me if [Bulgarian] is the language of [A Cricket in the Ear].', 'question_type': 'yesno_movie_language', 'topic_entity': ['A Cricket in the Ear', 'Bulgarian'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q4656181', 'https://www.wikidata.org/entity/Q7918'], 'answer': ['YES'], 'answer_id': [], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK { ?movie wd:P364 ?e1 ; rdfs:label \"A Cricket in the Ear\" . ?e1 rdfs:label \"Bulgarian\". }'}, {'qid': 'mcqa-9274ab41-e67e-11ee-a27f-58961d663d9c', 'question': 'which actor from [True Confession] has co-starred with [Roscoe Karns] before?', 'question_type': 'actor_to_movie_to_actor_constraint_movie', 'topic_entity': ['Roscoe Karns', 'True Confession'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q2166695', 'https://www.wikidata.org/entity/Q2249058'], 'answer': ['Edgar Kennedy', 'Lynne Overman', 'Carole Lombard', 'Porter Hall', 'Irving Bacon', 'John Barrymore', 'Toby Wing'], 'answer_id': ['https://www.wikidata.org/entity/Q714724', 'https://www.wikidata.org/entity/Q3269588', 'https://www.wikidata.org/entity/Q207739', 'https://www.wikidata.org/entity/Q3399241', 'https://www.wikidata.org/entity/Q3116093', 'https://www.wikidata.org/entity/Q95034', 'https://www.wikidata.org/entity/Q1970219'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"starred_actors\". ?e1 rdfs:label \"Roscoe Karns\" . ?rel2 rdfs:label \"starred_actors\" . ?e2 ?rel1 ?e1 ; ?rel2 ?uri . ?uri rdfs:label ?label . FILTER (?label != \"Roscoe Karns\") ?rel4 rdfs:label \"starred_actors\" . ?e4 ?rel4 ?uri ; rdfs:label \"True Confession\" . }'}, {'qid': 'mcqa-9274ab42-e67e-11ee-a227-58961d663d9c', 'question': 'do you know which films have the same screenwriter as [The Green Room] and were released in [1968]?', 'question_type': 'movie_to_writer_to_movie_constraint_year', 'topic_entity': ['The Green Room', '1968'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1171341', 'https://www.wikidata.org/entity/Q101209905', 'https://www.wikidata.org/entity/Q50991354'], 'answer': ['The Bride Wore Black', 'Stolen Kisses'], 'answer_id': ['https://www.wikidata.org/entity/Q1211737', 'https://www.wikidata.org/entity/Q324933'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"The Green Room\" . ?uri ?rel1 ?e2 ; ?rel4 \"1968\" ; rdfs:label ?label ; FILTER (?label != \"The Green Room\") . ?rel4 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab43-e67e-11ee-966a-58961d663d9c', 'question': \"I'm curious if there's any confirmation of [Dace Eversa] in [Emil's Mischiefs].\", 'question_type': 'yesno_actor_movie', 'topic_entity': ['Dace Eversa', \"Emil's Mischiefs\"], 'topic_entity_id': ['https://www.wikidata.org/entity/Q4529655', 'https://www.wikidata.org/entity/Q2563648'], 'answer': ['YES'], 'answer_id': [], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK { ?actor rdfs:label \"Dace Eversa\". ?movie wd:P161 ?actor ; rdfs:label \"Emil\\'s Mischiefs\" . }'}, {'qid': 'mcqa-9274ab44-e67e-11ee-bf0d-58961d663d9c', 'question': 'who wrote films with [Rosamond Marshall] and also wrote for [Rebecca of Sunnybrook Farm] the movie?', 'question_type': 'writer_to_movie_to_writer_constraint_movie', 'topic_entity': ['Rosamond Marshall', 'Rebecca of Sunnybrook Farm'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q7367297', 'https://www.wikidata.org/entity/Q2205352', 'https://www.wikidata.org/entity/Q2379904', 'https://www.wikidata.org/entity/Q7301984'], 'answer': ['Karl Tunberg'], 'answer_id': ['https://www.wikidata.org/entity/Q459300'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\". ?e1 rdfs:label \"Rosamond Marshall\" . ?rel2 rdfs:label \"written_by\" . ?e2 ?rel1 ?e1 ; ?rel2 ?uri . ?uri rdfs:label ?label . FILTER (?label != \"Rosamond Marshall\") ?rel4 rdfs:label \"written_by\" . ?e4 ?rel4 ?uri ; rdfs:label \"Rebecca of Sunnybrook Farm\" . }'}, {'qid': 'mcqa-9274ab45-e67e-11ee-a9fe-58961d663d9c', 'question': '[emily blunt] and [meryl streep] are the topic of what movies?', 'question_type': 'tag_to_movie_constraint_tag', 'topic_entity': ['emily blunt', 'meryl streep'], 'topic_entity_id': ['https://www.wikidata.org/entity/MT263', 'https://www.wikidata.org/entity/MT1471'], 'answer': ['Into the Woods', 'The Devil Wears Prada'], 'answer_id': ['https://www.wikidata.org/entity/Q14847067', 'https://www.wikidata.org/entity/Q223316'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"has_tags\" . ?e1 rdfs:label \"emily blunt\" . ?rel2 rdfs:label \"has_tags\" . ?e2 rdfs:label \"meryl streep\" . }'}, {'qid': 'mcqa-9274ab46-e67e-11ee-9d84-58961d663d9c', 'question': 'What movies in [English] was the director of [Peter Smith]?', 'question_type': 'director_to_movie_constraint_language', 'topic_entity': ['Peter Smith', 'English'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q38053711', 'https://www.wikidata.org/entity/Q1860'], 'answer': ['A Perfect Spy', 'Children of the Dragon', 'A Private Enterprise', 'No Surrender'], 'answer_id': ['https://www.wikidata.org/entity/Q12126899', 'https://www.wikidata.org/entity/Q15039405', 'https://www.wikidata.org/entity/Q15039707', 'https://www.wikidata.org/entity/Q7045044'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?l  WHERE {     ?uri ?rel1 ?e1;     ?rel2 ?e2;     rdfs:label ?l.     ?rel1 rdfs:label \"directed_by\".     ?e1 rdfs:label \"Peter Smith\".     ?rel2 rdfs:label \"in_language\".     ?e2 rdfs:label \"English\". }'}, {'qid': 'mcqa-9274ab47-e67e-11ee-9806-58961d663d9c', 'question': 'Which actor was in both [The Wolf of Wall Street] and in [The Aviator]?', 'question_type': 'movie_to_actor_constraint_movie', 'topic_entity': ['The Wolf of Wall Street', 'The Aviator'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1392744', 'https://www.wikidata.org/entity/Q15231297', 'https://www.wikidata.org/entity/Q201924', 'https://www.wikidata.org/entity/Q484860', 'https://www.wikidata.org/entity/Q7715039'], 'answer': ['Leonardo DiCaprio'], 'answer_id': ['https://www.wikidata.org/entity/Q38111'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?e1 ?rel ?uri; rdfs:label \"The Wolf of Wall Street\" . ?e3 ?rel ?uri; rdfs:label \"The Aviator\" . ?rel rdfs:label \"starred_actors\" . ?uri rdfs:label ?label . }'}, {'qid': 'mcqa-9274ab48-e67e-11ee-9837-58961d663d9c', 'question': 'What films did [Cy Endfield] direct that had the [adventure film] genre?', 'question_type': 'director_to_movie_constraint_genre', 'topic_entity': ['Cy Endfield', 'adventure film'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q673315', 'https://www.wikidata.org/entity/Q319221'], 'answer': ['Zulu', 'Mysterious Island', 'Sands of the Kalahari', \"Tarzan's Savage Fury\"], 'answer_id': ['https://www.wikidata.org/entity/Q228867', 'https://www.wikidata.org/entity/Q212675', 'https://www.wikidata.org/entity/Q3427377', 'https://www.wikidata.org/entity/Q947995'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"directed_by\" . ?e1 rdfs:label \"Cy Endfield\" . ?rel2 rdfs:label \"has_genre\" . ?e2 rdfs:label \"adventure film\" . }'}, {'qid': 'mcqa-9274ab49-e67e-11ee-a494-58961d663d9c', 'question': 'In [2012], [Steve Rash] was the director of what films?', 'question_type': 'director_to_movie_constraint_year', 'topic_entity': ['Steve Rash', '2012'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q2632767', 'https://www.wikidata.org/entity/Q184605', 'https://www.wikidata.org/entity/Q211943'], 'answer': ['Crooked Arrows'], 'answer_id': ['https://www.wikidata.org/entity/Q5187783'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 \"2012\" ; rdfs:label ?label . ?rel1 rdfs:label \"directed_by\" . ?e1 rdfs:label \"Steve Rash\" . ?rel2 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab4a-e67e-11ee-b516-58961d663d9c', 'question': 'What screenplays were written by [Lawrence Sanders] in [1971]?', 'question_type': 'writer_to_movie_constraint_year', 'topic_entity': ['Lawrence Sanders', '1971'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1397305', 'https://www.wikidata.org/entity/Q16202471', 'https://www.wikidata.org/entity/Q4574404'], 'answer': ['The Anderson Tapes'], 'answer_id': ['https://www.wikidata.org/entity/Q1192193'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 \"1971\" ; rdfs:label ?label . ?rel1 rdfs:label \"written_by\" . ?e1 rdfs:label \"Lawrence Sanders\" . ?rel2 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab4b-e67e-11ee-9f13-58961d663d9c', 'question': 'who appeared in the same movie as [Garrett Strommen] and also acted in [The Man Who Loved Women]?', 'question_type': 'actor_to_movie_to_actor_constraint_movie', 'topic_entity': ['Garrett Strommen', 'The Man Who Loved Women'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1494455', 'https://www.wikidata.org/entity/Q1195396', 'https://www.wikidata.org/entity/Q139542'], 'answer': ['Kim Basinger'], 'answer_id': ['https://www.wikidata.org/entity/Q131380'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"starred_actors\". ?e1 rdfs:label \"Garrett Strommen\" . ?rel2 rdfs:label \"starred_actors\" . ?e2 ?rel1 ?e1 ; ?rel2 ?uri . ?uri rdfs:label ?label . FILTER (?label != \"Garrett Strommen\") ?rel4 rdfs:label \"starred_actors\" . ?e4 ?rel4 ?uri ; rdfs:label \"The Man Who Loved Women\" . }'}, {'qid': 'mcqa-9274ab4c-e67e-11ee-b6b6-58961d663d9c', 'question': 'Which films have [Corey Yuen] directed and has tag [karate]?', 'question_type': 'director_to_movie_constraint_tag', 'topic_entity': ['Corey Yuen', 'karate'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q676051', 'https://www.wikidata.org/entity/MT189'], 'answer': ['No Retreat, No Surrender'], 'answer_id': ['https://www.wikidata.org/entity/Q1326650'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"directed_by\" . ?e1 rdfs:label \"Corey Yuen\" . ?rel2 rdfs:label \"has_tags\" . ?e2 rdfs:label \"karate\" . }'}, {'qid': 'mcqa-9274ab4d-e67e-11ee-ae53-58961d663d9c', 'question': 'I would like to know what movies [Eduardo Noriega] acted in that were filmed in [French].', 'question_type': 'actor_to_movie_constraint_language', 'topic_entity': ['Eduardo Noriega', 'French'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q3048359', 'https://www.wikidata.org/entity/Q150'], 'answer': ['Beauty and the Beast', 'My Angel', 'Novo', 'Guerreros', 'Transsiberian', 'Where Is Madame Catherine?'], 'answer_id': ['https://www.wikidata.org/entity/Q3206615', 'https://www.wikidata.org/entity/Q3319838', 'https://www.wikidata.org/entity/Q3345502', 'https://www.wikidata.org/entity/Q376291', 'https://www.wikidata.org/entity/Q688506', 'https://www.wikidata.org/entity/Q7993296'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?l  WHERE {     ?uri ?rel1 ?e1;     ?rel2 ?e2;     rdfs:label ?l.     ?rel1 rdfs:label \"starred_actors\".     ?e1 rdfs:label \"Eduardo Noriega\".     ?rel2 rdfs:label \"in_language\".     ?e2 rdfs:label \"French\". }'}, {'qid': 'mcqa-9274ab4e-e67e-11ee-aac6-58961d663d9c', 'question': 'can you name the movies directed by the same director as [Tonight and Every Night] that are classified under [crime film]?', 'question_type': 'movie_to_director_to_movie_constraint_genre', 'topic_entity': ['Tonight and Every Night', 'crime film'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q303095', 'https://www.wikidata.org/entity/Q959790'], 'answer': ['Calling Bulldog Drummond'], 'answer_id': ['https://www.wikidata.org/entity/Q5022155'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"directed_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"Tonight and Every Night\" . ?uri ?rel1 ?e2 ; ?rel4 ?e4 ; rdfs:label ?label . FILTER (?label != \"Tonight and Every Night\") ?rel4 rdfs:label \"has_genre\" . ?e4 rdfs:label \"crime film\" . }'}, {'qid': 'mcqa-9274ab4f-e67e-11ee-953b-58961d663d9c', 'question': 'What [Bengali] films did [Pratim D. Gupta] write?', 'question_type': 'writer_to_movie_constraint_language', 'topic_entity': ['Pratim D. Gupta', 'Bengali'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q7238698', 'https://www.wikidata.org/entity/Q9610'], 'answer': ['Maacher Jhol', 'Ahare Mon', 'Paanch Adhyay'], 'answer_id': ['https://www.wikidata.org/entity/Q39048878', 'https://www.wikidata.org/entity/Q55391591', 'https://www.wikidata.org/entity/Q7121435'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?l  WHERE {     ?uri ?rel1 ?e1;     ?rel2 ?e2;     rdfs:label ?l.     ?rel1 rdfs:label \"written_by\".     ?e1 rdfs:label \"Pratim D. Gupta\".     ?rel2 rdfs:label \"in_language\".     ?e2 rdfs:label \"Bengali\". }'}, {'qid': 'mcqa-9274ab50-e67e-11ee-9b49-58961d663d9c', 'question': 'Share the screenwriter with [Miracle in Milan], in [1962] what films were released?', 'question_type': 'movie_to_writer_to_movie_constraint_year', 'topic_entity': ['Miracle in Milan', '1962'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1170844'], 'answer': ['Salvatore Giuliano', \"Boccaccio '70\", 'Three Fables of Love', 'The Condemned of Altona', 'The Raffle', \"Arturo's Island\"], 'answer_id': ['https://www.wikidata.org/entity/Q1783832', 'https://www.wikidata.org/entity/Q18409', 'https://www.wikidata.org/entity/Q3235049', 'https://www.wikidata.org/entity/Q1406083', 'https://www.wikidata.org/entity/Q29532424', 'https://www.wikidata.org/entity/Q75593'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"Miracle in Milan\" . ?uri ?rel1 ?e2 ; ?rel4 \"1962\" ; rdfs:label ?label ; FILTER (?label != \"Miracle in Milan\") . ?rel4 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab51-e67e-11ee-9dce-58961d663d9c', 'question': 'Can you list movies in which [Marek Miller] provided the screenplay and [Waldemar Dziki] directed?', 'question_type': 'writer_director_movie', 'topic_entity': ['Marek Miller', 'Waldemar Dziki'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q11768321', 'https://www.wikidata.org/entity/Q9370143'], 'answer': ['Pierwszy milion'], 'answer_id': ['https://www.wikidata.org/entity/Q16587817'], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?movie ?movie_label WHERE {?movie wd:P58 ?e1 ; wd:P57 ?e2 ; rdfs:label ?movie_label. ?e1 rdfs:label \"Marek Miller\". ?e2 rdfs:label \"Waldemar Dziki\". }'}, {'qid': 'mcqa-9274ab52-e67e-11ee-a5b4-58961d663d9c', 'question': 'Can you tell me which movies [J. Grubb Alexander] wrote and [Bramwell Fletcher] acted in?', 'question_type': 'writer_to_movie_constraint_actor', 'topic_entity': ['J. Grubb Alexander', 'Bramwell Fletcher'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q6105849', 'https://www.wikidata.org/entity/Q523390'], 'answer': ['Svengali'], 'answer_id': ['https://www.wikidata.org/entity/Q1858039'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"written_by\" . ?e1 rdfs:label \"J. Grubb Alexander\" . ?rel2 rdfs:label \"starred_actors\" . ?e2 rdfs:label \"Bramwell Fletcher\" . }'}, {'qid': 'mcqa-9274ab53-e67e-11ee-8f27-58961d663d9c', 'question': 'What are the films from [1993] that carry the [slice of life] genre?', 'question_type': 'year_genre_movie', 'topic_entity': ['1993', 'slice of life'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q2561438'], 'answer': ['The Flood: Who Will Save Our Children?', 'The Oak', 'Armelle'], 'answer_id': ['https://www.wikidata.org/entity/Q18425222', 'https://www.wikidata.org/entity/Q2328850', 'https://www.wikidata.org/entity/Q9159955'], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?movie ?movie_label WHERE {?movie wd:publication_year \"1993\"; wd:P136 ?e; rdfs:label ?movie_label. ?e rdfs:label \"slice of life\". }'}, {'qid': 'mcqa-9274ab54-e67e-11ee-916e-58961d663d9c', 'question': 'Has [Mishqah Parthiephal] ever collaborated with [Amir Shahab Razavian] on a film?', 'question_type': 'yesno_actor_director', 'topic_entity': ['Mishqah Parthiephal', 'Amir Shahab Razavian'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q64049831', 'https://www.wikidata.org/entity/Q4746634'], 'answer': ['NO'], 'answer_id': [], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK { ?movie wd:P161 ?e1 ; wd:P57 ?e2. ?e1 rdfs:label \"Mishqah Parthiephal\". ?e2 rdfs:label \"Amir Shahab Razavian\". }'}, {'qid': 'mcqa-9274ab55-e67e-11ee-bead-58961d663d9c', 'question': 'which actors were in both films directed by [Howard Franklin] and [Jimmy Hollywood]?', 'question_type': 'director_to_movie_to_actor_constraint_movie', 'topic_entity': ['Howard Franklin', 'Jimmy Hollywood'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q3141551', 'https://www.wikidata.org/entity/Q1688957'], 'answer': ['Joe Pesci'], 'answer_id': ['https://www.wikidata.org/entity/Q20178'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"directed_by\". ?e1 rdfs:label \"Howard Franklin\" . ?rel2 rdfs:label \"starred_actors\" . ?e2 ?rel1 ?e1 ; ?rel2 ?uri . ?uri rdfs:label ?label . FILTER (?label != \"Howard Franklin\") ?rel4 rdfs:label \"starred_actors\" . ?e4 ?rel4 ?uri ; rdfs:label \"Jimmy Hollywood\" . }'}, {'qid': 'mcqa-9274ab56-e67e-11ee-bdf0-58961d663d9c', 'question': 'What movies written by [Adam Gierasch] broach the topic [bd-r]?', 'question_type': 'writer_to_movie_constraint_tag', 'topic_entity': ['Adam Gierasch', 'bd-r'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q4138857', 'https://www.wikidata.org/entity/MT3'], 'answer': ['Night of the Demons'], 'answer_id': ['https://www.wikidata.org/entity/Q2596218'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"written_by\" . ?e1 rdfs:label \"Adam Gierasch\" . ?rel2 rdfs:label \"has_tags\" . ?e2 rdfs:label \"bd-r\" . }'}, {'qid': 'mcqa-9274ab57-e67e-11ee-9cac-58961d663d9c', 'question': 'who was the screenwriter for the films directed by [Berk Tokay] and also wrote for [King Shakir: Land of Pirates]?', 'question_type': 'director_to_movie_to_writer_constraint_movie', 'topic_entity': ['Berk Tokay', 'King Shakir: Land of Pirates'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q6021388', 'https://www.wikidata.org/entity/Q71283941'], 'answer': ['Haluk Can Dizdaroğlu', 'Varol Yaşaroğlu'], 'answer_id': ['https://www.wikidata.org/entity/Q12809860', 'https://www.wikidata.org/entity/Q12812430'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?label  WHERE {     ?intermediate_ent_1 ?rel1 ?e1;     ?rel2 ?uri.     ?e2 ?rel3 ?uri.     ?uri rdfs:label ?label.     ?rel1 rdfs:label \"directed_by\".     ?e1 rdfs:label \"Berk Tokay\".     ?rel2 rdfs:label \"written_by\".     ?e2 rdfs:label \"King Shakir: Land of Pirates\".     ?rel2 rdfs:label \"written_by\".      }'}, {'qid': 'mcqa-9274ab58-e67e-11ee-bc20-58961d663d9c', 'question': 'What films are there that are tagged with [anna kendrick] and [Brittany Snow] has appeared in?', 'question_type': 'actor_to_movie_constraint_tag', 'topic_entity': ['Brittany Snow', 'anna kendrick'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q229975', 'https://www.wikidata.org/entity/MT1239'], 'answer': ['Pitch Perfect'], 'answer_id': ['https://www.wikidata.org/entity/Q137584'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"starred_actors\" . ?e1 rdfs:label \"Brittany Snow\" . ?rel2 rdfs:label \"has_tags\" . ?e2 rdfs:label \"anna kendrick\" . }'}, {'qid': 'mcqa-9274ab59-e67e-11ee-a916-58961d663d9c', 'question': \"Which [drama] film's story was written by [Robert Bolt]?\", 'question_type': 'writer_to_movie_constraint_genre', 'topic_entity': ['Robert Bolt', 'drama'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q26062', 'https://www.wikidata.org/entity/Q130232', 'https://www.wikidata.org/entity/Q21010853', 'https://www.wikidata.org/entity/Q25372', 'https://www.wikidata.org/entity/MT95'], 'answer': ['The Bounty', \"Ryan's Daughter\", 'A Man for All Seasons', 'Lawrence of Arabia', 'The Red Tent', 'The Mission', 'Doctor Zhivago'], 'answer_id': ['https://www.wikidata.org/entity/Q1211716', 'https://www.wikidata.org/entity/Q1423795', 'https://www.wikidata.org/entity/Q218999', 'https://www.wikidata.org/entity/Q228186', 'https://www.wikidata.org/entity/Q2714901', 'https://www.wikidata.org/entity/Q302490', 'https://www.wikidata.org/entity/Q323827'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"written_by\" . ?e1 rdfs:label \"Robert Bolt\" . ?rel2 rdfs:label \"has_genre\" . ?e2 rdfs:label \"drama\" . }'}, {'qid': 'mcqa-9274ab5a-e67e-11ee-9b1c-58961d663d9c', 'question': 'What movies did [James Edward Grant] write that [James Garner] starred in?', 'question_type': 'writer_to_movie_constraint_actor', 'topic_entity': ['James Edward Grant', 'James Garner'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q119576', 'https://www.wikidata.org/entity/Q108510'], 'answer': ['Support Your Local Gunfighter'], 'answer_id': ['https://www.wikidata.org/entity/Q951168'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"written_by\" . ?e1 rdfs:label \"James Edward Grant\" . ?rel2 rdfs:label \"starred_actors\" . ?e2 rdfs:label \"James Garner\" . }'}, {'qid': 'mcqa-9274ab5b-e67e-11ee-bfc4-58961d663d9c', 'question': 'What movies are about [bruno barreto] and are in the [historical film] movies market?', 'question_type': 'tag_to_movie_constraint_genre', 'topic_entity': ['bruno barreto', 'historical film'], 'topic_entity_id': ['https://www.wikidata.org/entity/MT760', 'https://www.wikidata.org/entity/Q17013749'], 'answer': ['Four Days in September'], 'answer_id': ['https://www.wikidata.org/entity/Q137703'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?l  WHERE {     ?uri ?rel1 ?e1;     ?rel2 ?e2;     rdfs:label ?l.     ?rel1 rdfs:label \"has_tags\".     ?e1 rdfs:label \"bruno barreto\".     ?rel2 rdfs:label \"has_genre\".     ?e2 rdfs:label \"historical film\". }'}, {'qid': 'mcqa-9274ab5c-e67e-11ee-9a11-58961d663d9c', 'question': 'which films have the same screenwriter as [The Left Hand of God] and are categorised as [drama]?', 'question_type': 'movie_to_writer_to_movie_constraint_genre', 'topic_entity': ['The Left Hand of God', 'drama'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q473491', 'https://www.wikidata.org/entity/Q130232', 'https://www.wikidata.org/entity/Q21010853', 'https://www.wikidata.org/entity/Q25372', 'https://www.wikidata.org/entity/MT95'], 'answer': ['A Hatful of Rain', 'Paisà', 'Clash by Night', 'The Mountain Road', 'The Barbarian and the Geisha', 'These Thousand Hills', 'Island in the Sun', 'Human Desire'], 'answer_id': ['https://www.wikidata.org/entity/Q1523586', 'https://www.wikidata.org/entity/Q1764086', 'https://www.wikidata.org/entity/Q1766802', 'https://www.wikidata.org/entity/Q2080706', 'https://www.wikidata.org/entity/Q2430444', 'https://www.wikidata.org/entity/Q3285536', 'https://www.wikidata.org/entity/Q3549899', 'https://www.wikidata.org/entity/Q62976'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"The Left Hand of God\" . ?uri ?rel1 ?e2 ; ?rel4 ?e4 ; rdfs:label ?label . FILTER (?label != \"The Left Hand of God\") ?rel4 rdfs:label \"has_genre\" . ?e4 rdfs:label \"drama\" . }'}, {'qid': 'mcqa-9274ab5d-e67e-11ee-97c6-58961d663d9c', 'question': 'who co-wrote films with [Julia Strachey] as well as wrote for [Cheerful Weather for the Wedding]?', 'question_type': 'writer_to_movie_to_writer_constraint_movie', 'topic_entity': ['Julia Strachey', 'Cheerful Weather for the Wedding'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q6306769', 'https://www.wikidata.org/entity/Q5089345'], 'answer': ['Donald Rice'], 'answer_id': ['https://www.wikidata.org/entity/Q5295059'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\". ?e1 rdfs:label \"Julia Strachey\" . ?rel2 rdfs:label \"written_by\" . ?e2 ?rel1 ?e1 ; ?rel2 ?uri . ?uri rdfs:label ?label . FILTER (?label != \"Julia Strachey\") ?rel4 rdfs:label \"written_by\" . ?e4 ?rel4 ?uri ; rdfs:label \"Cheerful Weather for the Wedding\" . }'}, {'qid': 'mcqa-9274ab5e-e67e-11ee-8d5d-58961d663d9c', 'question': 'What movies did [Derek Jarman] direct that [Andrew Tiernan] starred in?', 'question_type': 'actor_to_movie_constraint_director', 'topic_entity': ['Andrew Tiernan', 'Derek Jarman'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q2846752', 'https://www.wikidata.org/entity/Q282787'], 'answer': ['Edward II'], 'answer_id': ['https://www.wikidata.org/entity/Q618617'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"starred_actors\" . ?e1 rdfs:label \"Andrew Tiernan\" . ?rel2 rdfs:label \"directed_by\" . ?e2 rdfs:label \"Derek Jarman\" . }'}, {'qid': 'mcqa-9274ab5f-e67e-11ee-b6c3-58961d663d9c', 'question': \"I'd like to know if [Kangalin Vaarthaigal] was directed by [Travis Fine].\", 'question_type': 'yesno_movie_director', 'topic_entity': ['Kangalin Vaarthaigal', 'Travis Fine'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q6362423', 'https://www.wikidata.org/entity/Q7836246'], 'answer': ['NO'], 'answer_id': [], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK { ?movie wd:P57 ?e1 ; rdfs:label \"Kangalin Vaarthaigal\" . ?e1 rdfs:label \"Travis Fine\". }'}, {'qid': 'mcqa-9274ab60-e67e-11ee-b926-58961d663d9c', 'question': 'Tell me how many films have been penned by [Jacques-Rémy Girerd].', 'question_type': 'writer_num_movies', 'topic_entity': ['Jacques-Rémy Girerd'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1054961'], 'answer': ['5'], 'answer_id': [], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT (COUNT(?movie) AS ?count) WHERE { ?movie wd:P58 ?e. ?e rdfs:label \"Jacques-Rémy Girerd\" . }'}, {'qid': 'mcqa-9274ab61-e67e-11ee-b395-58961d663d9c', 'question': 'Can you inform me if the writer of [Läskilinssi] also directed it?', 'question_type': 'yesno_movie_same_director_writer', 'topic_entity': ['Läskilinssi'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q28884612'], 'answer': ['YES'], 'answer_id': [], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> ASK { ?movie wd:P58 ?e1 ; wd:P57 ?e1; rdfs:label \"Läskilinssi\". }'}, {'qid': 'mcqa-9274ab62-e67e-11ee-947b-58961d663d9c', 'question': 'Can you name any movies released in [2008] that are about [adrien brody]?', 'question_type': 'tag_to_movie_constraint_year', 'topic_entity': ['adrien brody', '2008'], 'topic_entity_id': ['https://www.wikidata.org/entity/MT495'], 'answer': ['Cadillac Records', 'The Darjeeling Limited', 'The Brothers Bloom'], 'answer_id': ['https://www.wikidata.org/entity/Q149431', 'https://www.wikidata.org/entity/Q658944', 'https://www.wikidata.org/entity/Q990840'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 \"2008\" ; rdfs:label ?label . ?rel1 rdfs:label \"has_tags\" . ?e1 rdfs:label \"adrien brody\" . ?rel2 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab63-e67e-11ee-9af5-58961d663d9c', 'question': 'What movies released in [2001] can be described by [british]?', 'question_type': 'tag_to_movie_constraint_year', 'topic_entity': ['british', '2001'], 'topic_entity_id': ['https://www.wikidata.org/entity/MT56'], 'answer': ['Maybe Baby', 'Blow Dry', 'Mean Machine', \"Bridget Jones's Diary\"], 'answer_id': ['https://www.wikidata.org/entity/Q1914437', 'https://www.wikidata.org/entity/Q331180', 'https://www.wikidata.org/entity/Q376663', 'https://www.wikidata.org/entity/Q752313'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 \"2001\" ; rdfs:label ?label . ?rel1 rdfs:label \"has_tags\" . ?e1 rdfs:label \"british\" . ?rel2 rdfs:label \"release_year\" . }'}, {'qid': 'mcqa-9274ab64-e67e-11ee-992c-58961d663d9c', 'question': 'Can you inform me which [horror film] movies [Jonny Lee Miller] appears in ?', 'question_type': 'actor_to_movie_constraint_genre', 'topic_entity': ['Jonny Lee Miller', 'horror film'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q7516', 'https://www.wikidata.org/entity/Q200092'], 'answer': ['Mindhunters', 'Dracula 2000'], 'answer_id': ['https://www.wikidata.org/entity/Q1358271', 'https://www.wikidata.org/entity/Q484987'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"starred_actors\" . ?e1 rdfs:label \"Jonny Lee Miller\" . ?rel2 rdfs:label \"has_genre\" . ?e2 rdfs:label \"horror film\" . }'}, {'qid': 'mcqa-9274ab65-e67e-11ee-9e3d-58961d663d9c', 'question': 'What was the name of the [English] film for which [Alessandro Tanaka] wrote the story?', 'question_type': 'writer_to_movie_constraint_language', 'topic_entity': ['Alessandro Tanaka', 'English'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q22681435', 'https://www.wikidata.org/entity/Q1860'], 'answer': ['Skiptrace', 'The Sitter'], 'answer_id': ['https://www.wikidata.org/entity/Q18613571', 'https://www.wikidata.org/entity/Q798776'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?l  WHERE {     ?uri ?rel1 ?e1;     ?rel2 ?e2;     rdfs:label ?l.     ?rel1 rdfs:label \"written_by\".     ?e1 rdfs:label \"Alessandro Tanaka\".     ?rel2 rdfs:label \"in_language\".     ?e2 rdfs:label \"English\". }'}, {'qid': 'mcqa-9274ab66-e67e-11ee-9516-58961d663d9c', 'question': 'In what films in [Spanish] language did [Jorge Yáñez] act?', 'question_type': 'actor_to_movie_constraint_language', 'topic_entity': ['Jorge Yáñez', 'Spanish'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q5936275', 'https://www.wikidata.org/entity/Q1321'], 'answer': ['Neruda', 'A un metro de tí'], 'answer_id': ['https://www.wikidata.org/entity/Q23924670', 'https://www.wikidata.org/entity/Q55453798'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?l  WHERE {     ?uri ?rel1 ?e1;     ?rel2 ?e2;     rdfs:label ?l.     ?rel1 rdfs:label \"starred_actors\".     ?e1 rdfs:label \"Jorge Yáñez\".     ?rel2 rdfs:label \"in_language\".     ?e2 rdfs:label \"Spanish\". }'}, {'qid': 'mcqa-9274ab67-e67e-11ee-9720-58961d663d9c', 'question': 'What films did [Gary David Goldberg] direct that [Ted Danson] also starred in?', 'question_type': 'director_to_movie_constraint_actor', 'topic_entity': ['Gary David Goldberg', 'Ted Danson'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q932508', 'https://www.wikidata.org/entity/Q381203'], 'answer': ['Dad'], 'answer_id': ['https://www.wikidata.org/entity/Q1156922'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?uri ?rel1 ?e1 ; ?rel2 ?e2 ; rdfs:label ?label . ?rel1 rdfs:label \"directed_by\" . ?e1 rdfs:label \"Gary David Goldberg\" . ?rel2 rdfs:label \"starred_actors\" . ?e2 rdfs:label \"Ted Danson\" . }'}, {'qid': 'mcqa-9274ab68-e67e-11ee-851f-58961d663d9c', 'question': 'what are the movies that have the same screenwriter as [The Prince and the Pauper] and directed by [Russ Mayberry]?', 'question_type': 'movie_to_writer_to_movie_constraint_director', 'topic_entity': ['The Prince and the Pauper', 'Russ Mayberry'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q12291447', 'https://www.wikidata.org/entity/Q16254281', 'https://www.wikidata.org/entity/Q17632801', 'https://www.wikidata.org/entity/Q2624382', 'https://www.wikidata.org/entity/Q2628907', 'https://www.wikidata.org/entity/Q3225916', 'https://www.wikidata.org/entity/Q3795327', 'https://www.wikidata.org/entity/Q3922118', 'https://www.wikidata.org/entity/Q4378823', 'https://www.wikidata.org/entity/Q4378824', 'https://www.wikidata.org/entity/Q65215551', 'https://www.wikidata.org/entity/Q2176884'], 'answer': ['Unidentified Flying Oddball'], 'answer_id': ['https://www.wikidata.org/entity/Q1795954'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"written_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"The Prince and the Pauper\" . ?uri ?rel1 ?e2 ; ?rel4 ?e4 ; rdfs:label ?label . FILTER (?label != \"The Prince and the Pauper\") ?rel4 rdfs:label \"directed_by\" . ?e4 rdfs:label \"Russ Mayberry\" . }'}, {'qid': 'mcqa-9274ab69-e67e-11ee-9c93-58961d663d9c', 'question': 'What is a movie in [Hindi] that was penned by [K.D. Satyam]?', 'question_type': 'writer_to_movie_constraint_language', 'topic_entity': ['K.D. Satyam', 'Hindi'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q22121194', 'https://www.wikidata.org/entity/Q1568'], 'answer': ['Bollywood Diaries', 'Mukkabaaz'], 'answer_id': ['https://www.wikidata.org/entity/Q21646188', 'https://www.wikidata.org/entity/Q39047419'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?l  WHERE {     ?uri ?rel1 ?e1;     ?rel2 ?e2;     rdfs:label ?l.     ?rel1 rdfs:label \"written_by\".     ?e1 rdfs:label \"K.D. Satyam\".     ?rel2 rdfs:label \"in_language\".     ?e2 rdfs:label \"Hindi\". }'}, {'qid': 'mcqa-9274ab6a-e67e-11ee-979f-58961d663d9c', 'question': \"Any actor of [On the Job] that appeared in [Erik Matti]'s films?\", 'question_type': 'director_to_movie_to_actor_constraint_movie', 'topic_entity': ['Erik Matti', 'On the Job'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q5388719', 'https://www.wikidata.org/entity/Q108739940', 'https://www.wikidata.org/entity/Q15115047', 'https://www.wikidata.org/entity/Q7091394', 'https://www.wikidata.org/entity/Q7091395'], 'answer': ['Piolo Pascual', 'Gerald Anderson', 'Joel Torre'], 'answer_id': ['https://www.wikidata.org/entity/Q1956929', 'https://www.wikidata.org/entity/Q2412115', 'https://www.wikidata.org/entity/Q15644544'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"directed_by\". ?e1 rdfs:label \"Erik Matti\" . ?rel2 rdfs:label \"starred_actors\" . ?e2 ?rel1 ?e1 ; ?rel2 ?uri . ?uri rdfs:label ?label . FILTER (?label != \"Erik Matti\") ?rel4 rdfs:label \"starred_actors\" . ?e4 ?rel4 ?uri ; rdfs:label \"On the Job\" . }'}, {'qid': 'mcqa-9274ab6b-e67e-11ee-bef6-58961d663d9c', 'question': \"I'm curious, which films are both in [Bengali] and categorized as [telenovela]?\", 'question_type': 'language_genre_movie', 'topic_entity': ['Bengali', 'telenovela'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q9610', 'https://www.wikidata.org/entity/Q23745'], 'answer': ['Sakin Sarisuri'], 'answer_id': ['https://www.wikidata.org/entity/Q7402989'], 'sparql': 'PREFIX wd: <https://www.wikidata.org/entity/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?movie ?movie_label WHERE {?movie wd:P364 ?e1 ; wd:P136 ?e2 ; rdfs:label ?movie_label. ?e1 rdfs:label \"Bengali\". ?e2 rdfs:label \"telenovela\". }'}, {'qid': 'mcqa-9274ab6c-e67e-11ee-8b17-58961d663d9c', 'question': 'Who wrote the movies directed by [Filipp Yankovsky] and also wrote for [The State Counsellor]?', 'question_type': 'director_to_movie_to_writer_constraint_movie', 'topic_entity': ['Filipp Yankovsky', 'The State Counsellor'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q1342340', 'https://www.wikidata.org/entity/Q4441294'], 'answer': ['Boris Akunin'], 'answer_id': ['https://www.wikidata.org/entity/Q125663'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?label  WHERE {     ?intermediate_ent_1 ?rel1 ?e1;     ?rel2 ?uri.     ?e2 ?rel3 ?uri.     ?uri rdfs:label ?label.     ?rel1 rdfs:label \"directed_by\".     ?e1 rdfs:label \"Filipp Yankovsky\".     ?rel2 rdfs:label \"written_by\".     ?e2 rdfs:label \"The State Counsellor\".     ?rel2 rdfs:label \"written_by\".      }'}, {'qid': 'mcqa-9274ab6d-e67e-11ee-b4b5-58961d663d9c', 'question': 'In what does [Thomas Mørk] appear using [Swedish] language?', 'question_type': 'actor_to_movie_constraint_language', 'topic_entity': ['Thomas Mørk', 'Swedish'], 'topic_entity_id': ['https://www.wikidata.org/entity/Q2426229', 'https://www.wikidata.org/entity/Q9027'], 'answer': ['Hannah med H'], 'answer_id': ['https://www.wikidata.org/entity/Q1170819'], 'sparql': 'PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri ?l  WHERE {     ?uri ?rel1 ?e1;     ?rel2 ?e2;     rdfs:label ?l.     ?rel1 rdfs:label \"starred_actors\".     ?e1 rdfs:label \"Thomas Mørk\".     ?rel2 rdfs:label \"in_language\".     ?e2 rdfs:label \"Swedish\". }'}]\n"
     ]
    }
   ],
   "source": [
    "TEST_DATA_PATH = os.path.join(os.getcwd(), \"data\", \"qa_test.json\")\n",
    "TEST_DATA_RESULTS_PATH = os.path.join(os.getcwd(), \"data\", \"Gpt4o-qa_test_results.json\")\n",
    "\n",
    "with open(TEST_DATA_PATH, \"r\", encoding=\"utf-8\") as f:\n",
    "    test_dataset = json.load(f)[:100]\n",
    "\n",
    "if os.path.exists(TEST_DATA_RESULTS_PATH):\n",
    "    with open(TEST_DATA_RESULTS_PATH, \"r\", encoding=\"utf-8\") as f:\n",
    "        test_results = json.load(f)\n",
    "else:\n",
    "    test_results = []\n",
    "\n",
    "print(test_dataset)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## HANDLE ERROR (IF THERE IS)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Query results: [(rdflib.term.Literal('The Krays'), rdflib.term.URIRef('https://www.wikidata.org/entity/Q12125426')), (rdflib.term.Literal('Sex and Lies in Sin City'), rdflib.term.URIRef('https://www.wikidata.org/entity/Q2275467')), (rdflib.term.Literal('Romeo Is Bleeding'), rdflib.term.URIRef('https://www.wikidata.org/entity/Q624857')), (rdflib.term.Literal('Dating Game Killer'), rdflib.term.URIRef('https://www.wikidata.org/entity/Q73538437'))]\n"
     ]
    }
   ],
   "source": [
    "NO_RETRRY = 3\n",
    "query_results = None\n",
    "try:\n",
    "    query_results = graph.query(query)\n",
    "    print(f\"Query results: {query_results}\")\n",
    "except Exception as e:\n",
    "    retries = 0\n",
    "    error_message = str(e)\n",
    "    while retries < NO_RETRRY:\n",
    "        try:\n",
    "            print(f\"Invalid query. Retry count: {retries+1}\")\n",
    "            fix_sparql_query_messages = [\n",
    "                {\"role\": \"system\", \"content\": SPARQL_FIX_PROMPT},\n",
    "                {\n",
    "                    \"role\": \"user\",\n",
    "                    \"content\": f\"\"\"Question: {test_data_point['question']}\n",
    "Previous SparQL query: {query}\n",
    "Error message: {error_message}\n",
    "\"\"\",\n",
    "                },\n",
    "            ]\n",
    "            query = call_openai(\n",
    "                messages=fix_sparql_query_messages,\n",
    "                model_name=model_name,\n",
    "                temperature=0,\n",
    "                top_p=0,\n",
    "            )\n",
    "            print(f\"New query: {query}\")\n",
    "            query_results = graph.query(query)\n",
    "            print(f\"Query results: {query_results}\")\n",
    "            break\n",
    "        except Exception as e:\n",
    "            retries += 1\n",
    "            error_message = str(e)\n",
    "if query_results == None:\n",
    "    raise Exception(\"Invalid SparQL query. Stop answering\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Messages: [{'role': 'system', 'content': 'Generate a natural language response from the results of a SPARQL query.\\nDon\\'t use any internal knowledge to answer the question,\\nJust say you don\\'t know if no information is available from The results of a SPARQL query.\\nIf the question is Yes/No question and there is no information available, answer No.\\nSparQL query: PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?label ?uri WHERE { ?rel1 rdfs:label \"directed_by\" . ?e1 ?rel1 ?e2 ; rdfs:label \"Let Him Have It\" . ?uri ?rel1 ?e2 ; ?rel4 ?e4 ; rdfs:label ?label . FILTER (?label != \"Let Him Have It\") ?rel4 rdfs:label \"has_genre\" . ?e4 rdfs:label \"crime film\" . }\\nThe results of a SparQL query: [(rdflib.term.Literal(\\'The Krays\\'), rdflib.term.URIRef(\\'https://www.wikidata.org/entity/Q12125426\\')), (rdflib.term.Literal(\\'Sex and Lies in Sin City\\'), rdflib.term.URIRef(\\'https://www.wikidata.org/entity/Q2275467\\')), (rdflib.term.Literal(\\'Romeo Is Bleeding\\'), rdflib.term.URIRef(\\'https://www.wikidata.org/entity/Q624857\\')), (rdflib.term.Literal(\\'Dating Game Killer\\'), rdflib.term.URIRef(\\'https://www.wikidata.org/entity/Q73538437\\'))]'}, {'role': 'user', 'content': 'Question: which films have the same director as [Let Him Have It] and have genre [crime film]?'}]\n",
      "Model: gpt-4o\n",
      "Final Response:\n",
      "The films that have the same director as \"Let Him Have It\" and are of the genre \"crime film\" are \"The Krays,\" \"Sex and Lies in Sin City,\" \"Romeo Is Bleeding,\" and \"Dating Game Killer.\"\n"
     ]
    }
   ],
   "source": [
    "qa_answering_prompt = QA_PROMPT.replace(\"{{context}}\", str(query_results))\n",
    "qa_answering_prompt = qa_answering_prompt.replace(\"{{query}}\", str(query))\n",
    "qa_answering_messages = [\n",
    "    {\"role\": \"system\", \"content\": qa_answering_prompt},\n",
    "    {\"role\": \"user\", \"content\": f\"Question: {test_data_point['question']}\"},\n",
    "]\n",
    "final_response = call_openai(\n",
    "    messages=qa_answering_messages, model_name=\"gpt-4o\", temperature=0.5\n",
    ")\n",
    "print(f\"Final Response:\\n{final_response}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Calculate metrics\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The queries produce identical results.\n"
     ]
    }
   ],
   "source": [
    "# our query\n",
    "generated_results = set(graph.query(query))\n",
    "\n",
    "# sample query\n",
    "sample_results = set(graph.query(test_data_point[\"sparql\"]))\n",
    "\n",
    "# Compare the results\n",
    "if generated_results == sample_results:\n",
    "    print(\"The queries produce identical results.\")\n",
    "else:\n",
    "    print(\"The queries produce different results.\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "myenv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
